<?php

//Языковой файл для модуля Shopkeeper 1.0

$langTxt = array(
    "this" => "russian",
    "modTitle" => "управление заказами",
    "editTitle" => "Редактирование информации о заказе",
    "descTitle" => "Подробная информация",
    "configTitle" => "Конфигурация",
    "csv_export" => "Экспортировать в CSV",

    "changeCount" => "Изменить количество",

    "save" => "Сохранить",
    "accept_to_pay" => "Принять к оплате",
    "cancel" => "Отмена",
    "edit" => "Редактировать",
    "editShort" => "Ред.",
    "delete" => "Удалить",
    "back" => "Назад",

    "newOrder" => "Новый заказ",
    "note" => "Заметка",
    "shortInfo" => "Краткая информация",
    "contact" => "Контактная информация",
    "sumTotal" => "Общая стоимость",
    "orderDate" => "Дата заказа",
    "description" => "Подробности",
    "can_order" => "Можно заказать",
    "confirm" => "Вы уверены?",
    "noOrders" => "Заказов нет",
    "noSelected" => "Товары не выбраны",
    "currency" => "Валюта",
    "currencyDefault" => "руб.",
    "install" => "Установить модуль",
    "uninstallMod" => "Удалить все записи",
    "deleteChecked" => "Удалить отмеченные",
    "refresh" => "Обновить",
    "dateTime" => "Дата и время",
    "includes" => "Состав заказа",
    "email" => "E-mail",
    "phone" => "Номер телефона",
    "payment" => "Способ оплаты",
    "tracking_num" => "Трекинг номер",

    "mail_subject" => "Ваш заказ.",

    "perpage" => "Заказов на странице",
    "informing" => "Информирование",
    "conf_inventory" => "Учет товара на складе (имя TV)",
    "infg_status" => "Отправлять покупателю эл. письма при изменении статуса заказа",
    "phase" => "Статус",
    "phaseColors" => "Цвета статусов",
    "colorDefault" => "Вернуть цвета по умолчанию",
    "basic_settings" => "Основные настройки",
    "templates" => "Шаблоны",
    "template" => "Шаблон для контактной информации",
    "small_template" => "Шаблон для контактной информации в списке товаров",
    "tpl_mail_status" => "Шаблоны (чанки) для писем покупателю об изменении статуса заказа",
    "tpl_mail_shipped" => "Файл или имя чанка с шаблоном для письма покупателю об отправке заказа",
    "tpl_mail_canceled" => "Файл или имя чанка с шаблоном для письма покупателю об отмене заказа",

    "user" => "Пользо<wbr />ватель",
    "userData" => "Данные пользователя",
    "unregistered" => "Незарегистрированный пользователь",
    "count_purchase" => "Делал покупки",
    "times" => "раз",

    "plural" => array("товар","товара","товаров"),

    "phase1" => "Новый",
    "phase2" => "Принят к оплате",
    "phase3" => "Отправлен",
    "phase4" => "Выполнен",
    "phase5" => "Отменен",
    "phase6" => "Оплата получена",

    "conf_phase_days" => "Отменять заказ через, дн(я/ей)",

    "notify_title" => "Информация",
    "notify_mod_updated" => "Модуль обновлен до версии ",
    "notify_checked_orders_dates" => " заказ(ов) отменено, т.к. истек период ожидания оплаты",
    "notify_email_changestatus" => "Покупателю отправлено уведомление о смене статуса заказа",

    "order_changed" => "Обратите внимание, что состав заказа был изменен, т.к. некоторых позиций сейчас нет в наличии.",
    "order_notpossible" => "Вы не можете купить данный товар, т.к. его сейчас нет на складе.",

    //1.0
    "catalog_mod" => "Каталог",
    "no_category" => "Выберите категорию",
    "get_category" => "Выбрать категорию",
    "stopget_category" => "Остановить выбор",
    "goto_category" => "Перейти в категорию",
    "conf_catalog" => "Категория каталога по умолчанию (ID)",
    "new_product" => "Новый товар",
    "next" => "Следующая",
    "prev" => "Предыдущая",
    "pricetv" => "ID TV-параметра цены",
    
    //1.2
    "add_to_order" => "Добавить к заказу",
    "id" => "ID",
    "count" => "Кол-во",
    "prod_price" => "Цена",
    "prod_params" => "Параметры",
    "prod_params_help" => "* Формат параметров: <b>Название1==Цена1||Название2==Цена2</b>",
    
    "filter_user" => "Поиск заказов по пользователю",
    "search" => "Искать",
    "search_orderid" => "ID заказа"
  
);


?>