
--
-- Структура таблицы `{PREFIX}catalog`
--

CREATE TABLE IF NOT EXISTS `{PREFIX}catalog` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `pagetitle` varchar(255) NOT NULL DEFAULT '',
  `alias` varchar(255) DEFAULT '',
  `published` int(1) NOT NULL DEFAULT '0',
  `parent` int(10) NOT NULL DEFAULT '0',
  `isfolder` int(1) NOT NULL DEFAULT '0',
  `introtext` text,
  `content` text,
  `template` int(10) NOT NULL DEFAULT '1',
  `menuindex` int(10) NOT NULL DEFAULT '0',
  `createdon` int(20) NOT NULL DEFAULT '0',
  `hidemenu` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `id` (`id`),
  KEY `parent` (`parent`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=5 ;

--
-- Дамп данных таблицы `{PREFIX}catalog`
--
TRUNCATE TABLE `{PREFIX}catalog`;

INSERT INTO `{PREFIX}catalog` (`id`, `pagetitle`, `alias`, `published`, `parent`, `isfolder`, `introtext`, `content`, `template`, `menuindex`, `createdon`, `hidemenu`) VALUES
(1, 'Флэш - накопитель', 'flesh_-_nakopitel', 1, 86, 0, 'На эту флэшку поместится очень много вирусов и вы сможете всегда носить с собой своих любимых питомцев!', '<p>Шурф по определению концентрирует многофазный бур, однозначно свидетельствуя о неустойчивости процесса в целом. Принимая во внимание искусственность границ элементарной почвы и произвольность ее положения в пространстве почвенного покрова, плодородие непрерывно. Ёмкость катионного обмена приводит к появлению ортштейн, что дает возможность использования данной методики как универсальной. Бур, как бы это ни казалось парадоксальным, вымывает в лёсс только в отсутствие тепло- и массообмена с окружающей средой. Сопротивление кумулятивно.</p>', 13, 0, 0, 0),
(2, 'Мышка', 'myishka', 1, 86, 0, 'Компьютерная мышь "Микки Маус" - лучший подарок системному администратору!', '<p>Солодь, согласно традиционным представлениям, эксперментально\r\nверифицируема. Переуплотнение взаимно. При переходе к следующему уровню\r\nорганизации почвенного покрова траншея отражает микроагрегат только в\r\nотсутствие тепло- и массообмена с окружающей средой. Парарендзина,\r\nвследствие пространственной неоднородности почвенного покрова,\r\nпоследовательно увлажняет коллоид при любом их взаимном расположении.\r\nГранулометрический анализ эволюционирует в дренаж, все дальнейшее\r\nдалеко выходит за рамки текущего исследования и не будет здесь\r\nрассматриваться. Орошение, если принять во внимание воздействие фактора\r\nвремени, эволюционирует в бурозём только в отсутствие тепло- и\r\nмассообмена с окружающей средой. </p>\r\n<p>Суффозия трансформирует лесной потенциал почвенной влаги только в\r\nотсутствие тепло- и массообмена с окружающей средой. Псевдомицелий\r\nнеустойчив. Микроагрегат, в случае использования адаптивно-ландшафтных\r\nсистем земледелия, неравномерен. Иллювиирование перемещает ортштейн,\r\nчто лишний раз подтверждает правоту Докучаева. </p>', 13, 0, 0, 0),
(3, 'Клавиатура', 'klaviatura', 1, 86, 0, 'Клавиатура "Микки Маус" разработана специально для продвинутых геймеров.', '<p>Кристаллическая решетка минералов обеднена. Облесение снижает\r\nсупесчаный гумус, все дальнейшее далеко выходит за рамки текущего\r\nисследования и не будет здесь рассматриваться. Ташет притягивает\r\nпочвообразующий лессиваж одинаково по всем направлениям. Бугор пучения\r\nтрансформирует смешанный горизонт в полном соответствии с законом\r\nДарси. </p>\r\n<p>Гетерогенная среда едва ли квантуема. Альбедо дает иловатый грунт,\r\nхотя этот факт нуждается в дальнейшей тщательной экспериментальной\r\nпроверке. Переуплотнение, в случае использования адаптивно-ландшафтных\r\nсистем земледелия, возникает псевдомицелий одинаково по всем\r\nнаправлениям. Карбонат кальция нагревает песчаный песок только в\r\nотсутствие тепло- и массообмена с окружающей средой. </p>', 13, 0, 0, 0),
(4, 'Коврик', '', 1, 86, 0, 'Коврики "Микки Маус" хорошо известны ценителям комфортной работы.', '<p>Подбур, согласно традиционным представлениям, традиционен. Несмотря\r\nна кажущуюся простоту эксперимента, анизотропия снижает фронт одинаково\r\nпо всем направлениям. Диэлькометрия, как того требуют законы\r\nтермодинамики, латерально окисляет гистерезис ОГХ одинаково по всем\r\nнаправлениям. Уровень грунтовых вод изменяем. Температуропроводность,\r\nкак следствие уникальности почвообразования в данных условиях,\r\nнаблюдаема.\r\n</p>\r\n<p>Траншея трансформирует глей, и этот процесс может повторяться\r\nмногократно. Определение, если принять во внимание воздействие фактора\r\nвремени, поглощает горизонт, хотя этот факт нуждается в дальнейшей\r\nтщательной экспериментальной проверке. Педон, в первом приближении,\r\nмгновенно адсорбирует желтозём при любом их взаимном расположении.\r\nМикрозападина, в случае использования адаптивно-ландшафтных систем\r\nземледелия, продуцирует глей, однозначно свидетельствуя о\r\nнеустойчивости процесса в целом. Чернозём устойчиво усиливает желтозём,\r\nхотя этот факт нуждается в дальнейшей тщательной экспериментальной\r\nпроверке. Элементарная почвенная частица повышает псевдомицелий, и этот\r\nпроцесс может повторяться многократно. </p>', 13, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `{PREFIX}catalog_tmplvar_contentvalues`
--

CREATE TABLE IF NOT EXISTS `{PREFIX}catalog_tmplvar_contentvalues` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `tmplvarid` int(10) NOT NULL DEFAULT '0' COMMENT 'Template Variable id',
  `contentid` int(10) NOT NULL DEFAULT '0' COMMENT 'Site Content Id',
  `value` text,
  PRIMARY KEY (`id`),
  KEY `idx_tmplvarid` (`tmplvarid`),
  KEY `idx_id` (`contentid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=21 ;

--
-- Дамп данных таблицы `{PREFIX}catalog_tmplvar_contentvalues`
--
TRUNCATE TABLE `{PREFIX}catalog_tmplvar_contentvalues`;

INSERT INTO `{PREFIX}catalog_tmplvar_contentvalues` (`id`, `tmplvarid`, `contentid`, `value`) VALUES
(1, 1, 1, '300'),
(2, 7, 1, '0'),
(3, 4, 1, 'assets/images/usb_flash.jpg'),
(4, 2, 1, '==||Упаковка==50||Сумочка==120'),
(5, 3, 1, 'розовый==0||черный==0'),
(6, 1, 2, '650'),
(7, 7, 2, '90'),
(8, 4, 2, 'assets/images/mouse.jpg'),
(9, 2, 2, '==||Упаковка==50||Сумочка==120'),
(10, 3, 2, 'розовый==0||черный==0'),
(11, 1, 3, '488.77'),
(12, 7, 3, '0'),
(13, 4, 3, 'assets/images/keyboard.jpg'),
(14, 2, 3, '==||Упаковка==50||Сумочка==120'),
(15, 3, 3, 'розовый==0||черный==0'),
(16, 1, 4, '330'),
(17, 7, 4, '60'),
(18, 4, 4, 'assets/images/mouse_pad.jpg'),
(19, 2, 4, '==||Упаковка==50||Сумочка==120'),
(20, 3, 4, 'розовый==0||черный==0');

-- --------------------------------------------------------

--
-- Дамп данных таблицы `{PREFIX}categories`
--

REPLACE INTO `{PREFIX}categories` (`id`, `category`) VALUES
(13, 'shop'),
(14, 'shop_eng');

-- --------------------------------------------------------

--
-- Структура таблицы `{PREFIX}manager_shopkeeper`
--
TRUNCATE TABLE `{PREFIX}manager_shopkeeper`;


CREATE TABLE IF NOT EXISTS `{PREFIX}manager_shopkeeper` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `short_txt` text NOT NULL,
  `content` longtext,
  `allowed` varchar(255) NOT NULL,
  `addit` text,
  `price` varchar(255) NOT NULL,
  `currency` varchar(255) NOT NULL,
  `date` datetime DEFAULT NULL,
  `sentdate` datetime DEFAULT NULL,
  `note` text NOT NULL,
  `email` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `payment` varchar(128) NOT NULL,
  `tracking_num` varchar(32) DEFAULT NULL,
  `status` int(11) NOT NULL,
  `userid` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=11 ;

-- --------------------------------------------------------

--
-- Структура таблицы `{PREFIX}manager_shopkeeper_config`
--

CREATE TABLE IF NOT EXISTS `{PREFIX}manager_shopkeeper_config` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `setting` varchar(255) DEFAULT NULL,
  `value` text,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=14 ;

--
-- Дамп данных таблицы `{PREFIX}manager_shopkeeper_config`
--
TRUNCATE TABLE `{PREFIX}manager_shopkeeper_config`;

INSERT INTO `{PREFIX}manager_shopkeeper_config` (`id`, `setting`, `value`) VALUES
(1, 'conf_template', 'Ф.И.О.: [+name+]<br />\r\nадрес: [+address+]<br />\r\nадрес эл. почты: [+email+]<br />\r\nтелефон: [+phone+]<br />\r\nспособ доставки [+delivery+]<br />\r\nспособ оплаты: [+payment+]'),
(2, 'conf_currency', 'руб.'),
(3, 'conf_perpage', '10'),
(4, 'conf_colors', '#C5CAFE~#B1F2FC~#F3FDB0~#BEFAB4~#FFAEAE~#FFE1A4'),
(5, 'conf_informing1', '1'),
(6, 'conf_inventory', 'inventory'),
(7, 'conf_phase_days', '2'),
(8, 'conf_pricetv', '1'),
(9, 'conf_catalog', '86'),
(10, 'conf_tpl_mail_status', '@FILE:mail_changeStatus.tpl'),
(11, 'conf_tpl_mail_shipped', '@FILE:mail_shipped.tpl'),
(12, 'conf_tpl_mail_canceled', '@FILE:mail_changeStatus.tpl'),
(13, 'conf_shk_version', '1.3'),
(14, 'conf_small_template', '[+name+], [+address+], [+email+], [+phone+], [+delivery+], [+payment+]');

-- --------------------------------------------------------


CREATE TABLE IF NOT EXISTS `{PREFIX}web_user_additdata` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `webuser` int(11) NOT NULL,
  `setting_name` varchar(50) NOT NULL DEFAULT '',
  `setting_value` text,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;


--
-- Структура таблицы `{PREFIX}site_content`
--

TRUNCATE TABLE `{PREFIX}site_content`;

--
-- Дамп данных таблицы `{PREFIX}site_content`
--

INSERT INTO `{PREFIX}site_content` (`id`, `type`, `contentType`, `pagetitle`, `longtitle`, `description`, `alias`, `link_attributes`, `published`, `pub_date`, `unpub_date`, `parent`, `isfolder`, `introtext`, `content`, `richtext`, `template`, `menuindex`, `searchable`, `cacheable`, `createdby`, `createdon`, `editedby`, `editedon`, `deleted`, `deletedon`, `deletedby`, `publishedon`, `publishedby`, `menutitle`, `donthit`, `haskeywords`, `hasmetatags`, `privateweb`, `privatemgr`, `content_dispo`, `hidemenu`) VALUES
(1, 'document', 'text/html', 'Главная', '', '', 'glavnaya', '', 1, 0, 0, 0, 0, '', '<p><strong>Shopkeeper</strong> &mdash; это программный модуль для создания интернет-магазина, написанный на языке PHP, для системы управления сайтом (CMS) <a href="http://modxcms.com/" target="_blank">MODx</a>. Эта бесплатная CMS по праву может называться самой универсальной и удобной. Используя MODx, вам не придется ограничивать себя жесткими рамками, которые присущи другим бесплатным и коммерческим системам. Эта CMS, а точнее CMF (Content Management Framework), подойдет как опытному программисту, так и начинающему разработчику (без знаний языка PHP). На сайте проекта <a href="http://modxcms.com/extras/" target="_blank">доступно</a> множество бесплатных дополнений, которые вы можете использовать совместно с Shopkeeper и расширить функциональность вашего сайта.\r\n</p>\r\n<p>Разрабатывая модуль Shopkeeper, мы стремимся не отступать от идеологии MODx &mdash; максимальная универсальность и удобство. Наша задача &mdash; не ограничивая фантазию дизайнера, дать разработчику максимум готовых возможностей для создания интернет-магазина любой направленности. С каждой новой версией мы стараемся расширить эти возможности.\r\n</p>', 1, 5, 0, 1, 1, 1, 1130304721, 1, 1294091323, 0, 0, 0, 1130304721, 1, '', 0, 0, 0, 0, 0, 0, 0),
(2, 'document', 'text/html', 'Демо', '', '', 'russkij_demo', '', 1, 1256240330, 0, 0, 1, '', '[[FirstChildRedirect]]<!-- hr -->7777', 0, 5, 2, 1, 0, 1, 1256240338, 1, 1292936025, 0, 0, 0, 1256240338, 1, '', 0, 0, 0, 0, 0, 0, 0),
(7, 'document', 'text/html', 'Пример 2', '', '', 'primer_2', '', 1, 0, 0, 2, 1, '', '<p>Подробный вид корзины. У товаров есть параметры, которые влияют на цену, а также которые не влияют (цвет). При нажатии на кнопку "В корзину" "окошко" с подтверждением не появляется.</p>', 1, 7, 2, 1, 1, 1, 1256246612, 1, 1294144880, 0, 0, 0, 1256246619, 1, '', 0, 0, 0, 0, 0, 0, 0),
(6, 'document', 'text/html', 'Пример 3', '', '', 'primer_3', '', 1, 1256245907, 0, 2, 1, '', '<p>При нажатии на кнопку картинка товара летит в корзину. Цена изменяется сразу при нажатии на чекбокс параметра. В корзине выводятся товары с картинками.</p>', 1, 8, 3, 1, 1, 1, 1256245916, 1, 1294251241, 0, 0, 0, 1256245916, 1, '', 0, 0, 0, 0, 0, 0, 0),
(79, 'document', 'text/html', 'Мышка', '', '', 'myishka', '', 1, 0, 0, 33, 0, 'Компьютерная мышь "Микки Маус" - лучший подарок системному администратору!', '<p>Солодь, согласно традиционным представлениям, эксперментально\r\nверифицируема. Переуплотнение взаимно. При переходе к следующему уровню\r\nорганизации почвенного покрова траншея отражает микроагрегат только в\r\nотсутствие тепло- и массообмена с окружающей средой. Парарендзина,\r\nвследствие пространственной неоднородности почвенного покрова,\r\nпоследовательно увлажняет коллоид при любом их взаимном расположении.\r\nГранулометрический анализ эволюционирует в дренаж, все дальнейшее\r\nдалеко выходит за рамки текущего исследования и не будет здесь\r\nрассматриваться. Орошение, если принять во внимание воздействие фактора\r\nвремени, эволюционирует в бурозём только в отсутствие тепло- и\r\nмассообмена с окружающей средой. </p>\r\n<p>Суффозия трансформирует лесной потенциал почвенной влаги только в\r\nотсутствие тепло- и массообмена с окружающей средой. Псевдомицелий\r\nнеустойчив. Микроагрегат, в случае использования адаптивно-ландшафтных\r\nсистем земледелия, неравномерен. Иллювиирование перемещает ортштейн,\r\nчто лишний раз подтверждает правоту Докучаева. </p>', 1, 14, 3, 1, 1, 1, 1282494044, 1, 1294250763, 0, 0, 0, 1282494093, 1, '', 0, 0, 0, 0, 0, 0, 0),
(80, 'document', 'text/html', 'Флэш - накопитель', '', '', 'flesh-nakopitel', '', 1, 0, 0, 33, 0, 'На эту флэшку поместится очень много вирусов и вы сможете всегда носить с собой своих любимых питомцев!', '<p>Шурф по определению концентрирует многофазный бур, однозначно свидетельствуя о неустойчивости процесса в целом. Принимая во внимание искусственность границ элементарной почвы и произвольность ее положения в пространстве почвенного покрова, плодородие непрерывно. Ёмкость катионного обмена приводит к появлению ортштейн, что дает возможность использования данной методики как универсальной. Бур, как бы это ни казалось парадоксальным, вымывает в лёсс только в отсутствие тепло- и массообмена с окружающей средой. Сопротивление кумулятивно.</p>', 1, 14, 0, 1, 1, 1, 1282494044, 1, 1294250561, 0, 0, 0, 1282494112, 1, '', 0, 0, 0, 0, 0, 0, 0),
(11, 'document', 'text/html', 'Пример 1', '', '', 'primer_1', '', 1, 0, 0, 2, 1, '', '<p>Сокращенный вид корзины. При нажатии на кнопку "В корзину" появляется "окошко" с выбором кол-ва и после подтверждения летит в корзину.</p>', 1, 6, 1, 1, 0, 1, 1256322720, 1, 1294144958, 0, 0, 0, 1256322776, 1, '', 0, 0, 0, 0, 0, 0, 0),
(15, 'document', 'text/html', 'Оформление заказа', '', '', 'oformlenie_zakaza', '', 1, 1256324535, 0, 2, 0, '', '<p>Обратите внимание, что, если выбрать способ доставки "на дом", доставка добавится в состав заказа.</p>\r\n', 0, 18, 6, 1, 0, 1, 1256324545, 1, 1283102003, 0, 0, 0, 1256324545, 1, '', 0, 0, 0, 0, 0, 0, 1),
(16, 'document', 'text/html', 'Спасибо!', '', '', 'spasibo', '', 1, 1256382063, 0, 2, 0, '', '<p>Ваш заказ отправлен.</p>', 0, 5, 7, 1, 0, 1, 1256382086, 1, 1286123955, 0, 0, 0, 1256382086, 1, '', 0, 0, 0, 0, 0, 0, 1),
(17, 'document', 'text/html', 'Регистрация', '', '', 'registracziya', '', 1, 1256501677, 0, 0, 0, '', '<p>[!WebSignup? &amp;tpl=`FormSignup`&amp;groups=`Customers`&amp;useCaptcha=`1`&amp;alerttpl=`websignap_alert`!]</p>', 1, 5, 4, 1, 1, 1, 1256501696, 1, 1279971480, 0, 0, 0, 1256501696, 1, '', 0, 0, 0, 0, 0, 0, 1),
(18, 'document', 'text/html', 'English demo', '', '', 'english_demo', '', 1, 0, 0, 0, 1, '', '[[FirstChildRedirect]]', 0, 5, 3, 1, 0, 1, 1266273704, 1, 1268944615, 0, 0, 0, 1266273836, 1, '', 0, 0, 0, 0, 0, 0, 0),
(54, 'document', 'text/html', 'Мои покупки', '', '', 'moi_pokupki', '', 1, 0, 0, 0, 0, '', '', 0, 5, 6, 1, 1, 1, 1269027780, 1, 1282497805, 0, 0, 0, 1269027780, 1, '', 0, 0, 0, 0, 0, 0, 1),
(48, 'document', 'text/html', 'Материал', '', '', 'material', '', 1, 0, 0, 0, 1, '', '', 1, 5, 5, 1, 1, 1, 1268169363, 1, 1268169378, 0, 0, 0, 1268169370, 1, '', 0, 0, 0, 0, 0, 0, 1),
(45, 'document', 'text/html', 'Mouse', '', '', 'mouse', '', 1, 0, 0, 42, 0, 'Computer Mouse "Mickey Mouse" - a best gift to the system administrator!', '<p>Lorem ipsum dolor sit amet consectetuer condimentum lorem feugiat odio condimentum. Lobortis massa sit semper malesuada Sed ligula leo felis at quis. Vel Vestibulum Quisque tortor vitae Ut wisi Suspendisse nec.</p>\r\n<p>Vel congue enim Proin ipsum molestie at id vestibulum sem In. Non ante arcu dolor adipiscing orci justo sagittis dui massa commodo. Senectus penatibus pede mauris Sed pellentesque gravida Ut dolor eros Nam. Nunc.</p>\r\n<p>Tortor ut dictum at Nulla ligula sem tristique eu sed sodales. Elit Praesent id adipiscing In nunc et felis nascetur justo lacus. Adipiscing tristique sit sagittis senectus wisi mauris mauris Vestibulum et lobortis. Tempus justo pellentesque nunc lacus congue lacinia molestie consequat sagittis elit. Justo fringilla at lobortis ut Phasellus justo sem ipsum turpis eros. Tellus Quisque et nec et velit Fusce auctor feugiat nibh urna. Dignissim consequat tristique augue elit lacinia pretium auctor dui non Curabitur. Vestibulum pellentesque ac auctor ac.</p>', 1, 17, 2, 1, 1, 1, 1267040042, 1, 1282504828, 0, 0, 0, 1267040478, 1, '', 0, 0, 0, 0, 0, 0, 0),
(43, 'document', 'text/html', 'Mousepad', '', '', 'mousepad', '', 1, 0, 0, 42, 0, 'Mouse pads "Mickey Mouse" is well known to connoisseurs of comfort.', '<p>Lorem ipsum dolor sit amet consectetuer condimentum lorem feugiat odio condimentum. Lobortis massa sit semper malesuada Sed ligula leo felis at quis. Vel Vestibulum Quisque tortor vitae Ut wisi Suspendisse nec.</p>\r\n<p>Vel congue enim Proin ipsum molestie at id vestibulum sem In. Non ante arcu dolor adipiscing orci justo sagittis dui massa commodo. Senectus penatibus pede mauris Sed pellentesque gravida Ut dolor eros Nam. Nunc.</p>\r\n<p>Tortor ut dictum at Nulla ligula sem tristique eu sed sodales. Elit Praesent id adipiscing In nunc et felis nascetur justo lacus. Adipiscing tristique sit sagittis senectus wisi mauris mauris Vestibulum et lobortis. Tempus justo pellentesque nunc lacus congue lacinia molestie consequat sagittis elit. Justo fringilla at lobortis ut Phasellus justo sem ipsum turpis eros. Tellus Quisque et nec et velit Fusce auctor feugiat nibh urna. Dignissim consequat tristique augue elit lacinia pretium auctor dui non Curabitur. Vestibulum pellentesque ac auctor ac.</p>', 1, 17, 0, 1, 1, 1, 1267040042, 1, 1282504800, 0, 0, 0, 1267040469, 1, '', 0, 0, 0, 0, 0, 0, 0),
(44, 'document', 'text/html', 'Keyboard', '', '', 'keyboard', '', 1, 0, 0, 42, 0, 'Keyboard "Mickey Mouse" is designed for serious gamers.', '<p>Lorem ipsum dolor sit amet consectetuer condimentum lorem feugiat odio condimentum. Lobortis massa sit semper malesuada Sed ligula leo felis at quis. Vel Vestibulum Quisque tortor vitae Ut wisi Suspendisse nec.</p>\r\n<p>Vel congue enim Proin ipsum molestie at id vestibulum sem In. Non ante arcu dolor adipiscing orci justo sagittis dui massa commodo. Senectus penatibus pede mauris Sed pellentesque gravida Ut dolor eros Nam. Nunc.</p>\r\n<p>Tortor ut dictum at Nulla ligula sem tristique eu sed sodales. Elit Praesent id adipiscing In nunc et felis nascetur justo lacus. Adipiscing tristique sit sagittis senectus wisi mauris mauris Vestibulum et lobortis. Tempus justo pellentesque nunc lacus congue lacinia molestie consequat sagittis elit. Justo fringilla at lobortis ut Phasellus justo sem ipsum turpis eros. Tellus Quisque et nec et velit Fusce auctor feugiat nibh urna. Dignissim consequat tristique augue elit lacinia pretium auctor dui non Curabitur. Vestibulum pellentesque ac auctor ac.</p>', 1, 17, 1, 1, 1, 1, 1267040042, 1, 1282504816, 0, 0, 0, 1267040474, 1, '', 0, 0, 0, 0, 0, 0, 0),
(27, 'document', 'text/html', 'Example 1', '', '', 'example_1', '', 1, 0, 0, 18, 0, '', '[[catalogView? &dataType=`documents`&parents=`42`&tpl=`@FILE:assets/snippets/shopkeeper/chunks/en/chunk_shopStuff.tpl`]]\r\n', 0, 15, 0, 1, 1, 1, 1266273704, 1, 1294243905, 0, 0, 0, 1266273874, 1, '', 0, 0, 0, 0, 0, 0, 0),
(31, 'document', 'text/html', 'Checkout', '', '', 'checkout', '', 1, 0, 0, 18, 0, '', '', 0, 19, 6, 1, 0, 1, 1266273704, 1, 1283102404, 0, 0, 0, 1266273836, 1, '', 0, 0, 0, 0, 0, 0, 1),
(86, 'document', 'text/html', 'Пример 6', '', '', 'primer_6', '', 1, 0, 0, 2, 1, '', '<p>Товары из каталога Shopkeeper (не документы MODx). Пример сортироваки и фильтрации. Используется плагин PHx.</p>', 1, 11, 6, 1, 1, 1, 1290778080, 1, 1294145581, 0, 0, 0, 1290778080, 1, '', 0, 0, 0, 0, 0, 0, 0),
(32, 'document', 'text/html', 'Thank you!', '', '', 'thank_you', '', 1, 0, 0, 18, 0, '', '<p>Your order has been accepted.</p>', 0, 5, 7, 1, 0, 1, 1266273704, 1, 1267043751, 0, 0, 0, 1266273836, 1, '', 0, 0, 0, 0, 0, 0, 1),
(42, 'document', 'text/html', 'Сatalog', '', '', 'catalog', '', 1, 0, 0, 18, 1, '', '', 0, 16, 2, 1, 1, 1, 1267040042, 1, 1282505312, 0, 0, 0, 1267040091, 1, '', 0, 0, 0, 0, 0, 0, 1),
(81, 'document', 'text/html', 'Example 2', '', '', 'example_2', '', 1, 0, 0, 18, 0, '', '[[catalogView? &dataType=`documents`&parents=`42`&tpl=`shopStuff2_eng`]]\r\n', 0, 16, 1, 1, 1, 1, 1282505352, 1, 1294243954, 0, 0, 0, 1282505352, 1, '', 0, 0, 0, 0, 0, 0, 0),
(33, 'document', 'text/html', 'Пример 4', '', '', 'primer_4', '', 1, 0, 0, 2, 1, '', '<p>Вывод товаров разделен на страницы. Демонстрация работы JS-функций для очистки и обновления корзины. На странице товара можно выбрать для него материал.</p>', 1, 9, 4, 1, 1, 1, 1266661419, 1, 1294145374, 0, 0, 0, 1266661460, 1, '', 0, 0, 0, 0, 0, 0, 0),
(49, 'document', 'text/html', 'Экокожа черная', '', '', 'ekokozha_chernaya', '', 1, 0, 0, 48, 0, '', '', 1, 5, 0, 1, 1, 1, 1268169785, 1, 1268169806, 0, 0, 0, 1268169806, 1, '', 0, 0, 0, 0, 0, 0, 0),
(50, 'document', 'text/html', 'Экокожа коричневая', '', '', 'ekokozha_korichnevaya', '', 1, 0, 0, 48, 0, '', '', 1, 5, 1, 1, 1, 1, 1268169847, 1, 1268169878, 0, 0, 0, 1268169878, 1, '', 0, 0, 0, 0, 0, 0, 0),
(51, 'document', 'text/html', 'Экокожа синяя', '', '', 'ekokozha_sinyaya', '', 1, 0, 0, 48, 0, '', '', 1, 5, 2, 1, 1, 1, 1268169891, 1, 1268169909, 0, 0, 0, 1268169896, 1, '', 0, 0, 0, 0, 0, 0, 0),
(52, 'document', 'text/html', 'Ткань NY темно-синяя', '', '', 'tkan_ny_temno-sinyaya', '', 1, 0, 0, 48, 0, '', '', 1, 5, 3, 1, 1, 1, 1268169960, 1, 1268169969, 0, 0, 0, 1268169969, 1, '', 0, 0, 0, 0, 0, 0, 0),
(53, 'document', 'text/html', 'Ткань NY зеленая', '', '', 'tkan_ny_zelenaya', '', 1, 0, 0, 48, 0, '', '', 1, 5, 4, 1, 1, 1, 1268170002, 1, 1268170011, 0, 0, 0, 1268170011, 1, '', 0, 0, 0, 0, 0, 0, 0),
(77, 'document', 'text/html', 'Коврик', '', '', 'kovrik', '', 1, 0, 0, 33, 0, 'Коврики "Микки Маус" хорошо известны ценителям комфортной работы.', '<p>Подбур, согласно традиционным представлениям, традиционен. Несмотря\r\nна кажущуюся простоту эксперимента, анизотропия снижает фронт одинаково\r\nпо всем направлениям. Диэлькометрия, как того требуют законы\r\nтермодинамики, латерально окисляет гистерезис ОГХ одинаково по всем\r\nнаправлениям. Уровень грунтовых вод изменяем. Температуропроводность,\r\nкак следствие уникальности почвообразования в данных условиях,\r\nнаблюдаема.\r\n</p>\r\n<p>Траншея трансформирует глей, и этот процесс может повторяться\r\nмногократно. Определение, если принять во внимание воздействие фактора\r\nвремени, поглощает горизонт, хотя этот факт нуждается в дальнейшей\r\nтщательной экспериментальной проверке. Педон, в первом приближении,\r\nмгновенно адсорбирует желтозём при любом их взаимном расположении.\r\nМикрозападина, в случае использования адаптивно-ландшафтных систем\r\nземледелия, продуцирует глей, однозначно свидетельствуя о\r\nнеустойчивости процесса в целом. Чернозём устойчиво усиливает желтозём,\r\nхотя этот факт нуждается в дальнейшей тщательной экспериментальной\r\nпроверке. Элементарная почвенная частица повышает псевдомицелий, и этот\r\nпроцесс может повторяться многократно. </p>', 1, 14, 1, 1, 1, 1, 1282494044, 1, 1294250738, 0, 0, 0, 1282494133, 1, '', 0, 0, 0, 0, 0, 0, 0),
(78, 'document', 'text/html', 'Клавиатура', '', '', 'klaviatura', '', 1, 0, 0, 33, 0, 'Клавиатура "Микки Маус" разработана специально для продвинутых геймеров.', '<p>Кристаллическая решетка минералов обеднена. Облесение снижает\r\nсупесчаный гумус, все дальнейшее далеко выходит за рамки текущего\r\nисследования и не будет здесь рассматриваться. Ташет притягивает\r\nпочвообразующий лессиваж одинаково по всем направлениям. Бугор пучения\r\nтрансформирует смешанный горизонт в полном соответствии с законом\r\nДарси. </p>\r\n<p>Гетерогенная среда едва ли квантуема. Альбедо дает иловатый грунт,\r\nхотя этот факт нуждается в дальнейшей тщательной экспериментальной\r\nпроверке. Переуплотнение, в случае использования адаптивно-ландшафтных\r\nсистем земледелия, возникает псевдомицелий одинаково по всем\r\nнаправлениям. Карбонат кальция нагревает песчаный песок только в\r\nотсутствие тепло- и массообмена с окружающей средой. </p>', 1, 14, 2, 1, 1, 1, 1282494044, 1, 1294250751, 0, 0, 0, 1282494067, 1, '', 0, 0, 0, 0, 0, 0, 0),
(71, 'document', 'text/html', 'Пример 5', '', '', 'primer_5', '', 1, 0, 0, 2, 1, '', '<p>У товаров две цены (продажа и прокат).</p>', 1, 10, 5, 1, 1, 1, 1281645605, 1, 1294145521, 0, 0, 0, 1281645690, 1, '', 0, 0, 0, 0, 0, 0, 0),
(82, 'document', 'text/html', 'Доставка', '', '', 'dostavka', '', 1, 0, 0, 2, 0, '', '', 1, 13, 9, 1, 1, 1, 1282682335, 1, 1282682335, 0, 0, 0, 1282682335, 1, '', 0, 0, 0, 0, 0, 0, 1),
(89, 'document', 'text/html', 'Флэш - накопитель', '', '', 'flesh_-_nakopitel', '', 1, 0, 0, 11, 0, 'На эту флэшку поместится очень много вирусов и вы сможете всегда носить с собой своих любимых питомцев!', '<p>Шурф по определению концентрирует многофазный бур, однозначно свидетельствуя о неустойчивости процесса в целом. Принимая во внимание искусственность границ элементарной почвы и произвольность ее положения в пространстве почвенного покрова, плодородие непрерывно. Ёмкость катионного обмена приводит к появлению ортштейн, что дает возможность использования данной методики как универсальной. Бур, как бы это ни казалось парадоксальным, вымывает в лёсс только в отсутствие тепло- и массообмена с окружающей средой. Сопротивление кумулятивно.</p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294250432, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(90, 'document', 'text/html', 'Мышка', '', '', 'myishka', '', 1, 0, 0, 11, 0, 'Компьютерная мышь "Микки Маус" - лучший подарок системному администратору!', '<p>Солодь, согласно традиционным представлениям, эксперментально\r\nверифицируема. Переуплотнение взаимно. При переходе к следующему уровню\r\nорганизации почвенного покрова траншея отражает микроагрегат только в\r\nотсутствие тепло- и массообмена с окружающей средой. Парарендзина,\r\nвследствие пространственной неоднородности почвенного покрова,\r\nпоследовательно увлажняет коллоид при любом их взаимном расположении.\r\nГранулометрический анализ эволюционирует в дренаж, все дальнейшее\r\nдалеко выходит за рамки текущего исследования и не будет здесь\r\nрассматриваться. Орошение, если принять во внимание воздействие фактора\r\nвремени, эволюционирует в бурозём только в отсутствие тепло- и\r\nмассообмена с окружающей средой. </p>\r\n<p>Суффозия трансформирует лесной потенциал почвенной влаги только в\r\nотсутствие тепло- и массообмена с окружающей средой. Псевдомицелий\r\nнеустойчив. Микроагрегат, в случае использования адаптивно-ландшафтных\r\nсистем земледелия, неравномерен. Иллювиирование перемещает ортштейн,\r\nчто лишний раз подтверждает правоту Докучаева. </p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294250420, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(91, 'document', 'text/html', 'Клавиатура', '', '', 'klaviatura', '', 1, 0, 0, 11, 0, 'Клавиатура "Микки Маус" разработана специально для продвинутых геймеров.', '<p>Кристаллическая решетка минералов обеднена. Облесение снижает\r\nсупесчаный гумус, все дальнейшее далеко выходит за рамки текущего\r\nисследования и не будет здесь рассматриваться. Ташет притягивает\r\nпочвообразующий лессиваж одинаково по всем направлениям. Бугор пучения\r\nтрансформирует смешанный горизонт в полном соответствии с законом\r\nДарси. </p>\r\n<p>Гетерогенная среда едва ли квантуема. Альбедо дает иловатый грунт,\r\nхотя этот факт нуждается в дальнейшей тщательной экспериментальной\r\nпроверке. Переуплотнение, в случае использования адаптивно-ландшафтных\r\nсистем земледелия, возникает псевдомицелий одинаково по всем\r\nнаправлениям. Карбонат кальция нагревает песчаный песок только в\r\nотсутствие тепло- и массообмена с окружающей средой. </p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294250408, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(92, 'document', 'text/html', 'Коврик', '', '', 'kovrik', '', 1, 0, 0, 11, 0, 'Коврики "Микки Маус" хорошо известны ценителям комфортной работы.', '<p>Подбур, согласно традиционным представлениям, традиционен. Несмотря\r\nна кажущуюся простоту эксперимента, анизотропия снижает фронт одинаково\r\nпо всем направлениям. Диэлькометрия, как того требуют законы\r\nтермодинамики, латерально окисляет гистерезис ОГХ одинаково по всем\r\nнаправлениям. Уровень грунтовых вод изменяем. Температуропроводность,\r\nкак следствие уникальности почвообразования в данных условиях,\r\nнаблюдаема.\r\n</p>\r\n<p>Траншея трансформирует глей, и этот процесс может повторяться\r\nмногократно. Определение, если принять во внимание воздействие фактора\r\nвремени, поглощает горизонт, хотя этот факт нуждается в дальнейшей\r\nтщательной экспериментальной проверке. Педон, в первом приближении,\r\nмгновенно адсорбирует желтозём при любом их взаимном расположении.\r\nМикрозападина, в случае использования адаптивно-ландшафтных систем\r\nземледелия, продуцирует глей, однозначно свидетельствуя о\r\nнеустойчивости процесса в целом. Чернозём устойчиво усиливает желтозём,\r\nхотя этот факт нуждается в дальнейшей тщательной экспериментальной\r\nпроверке. Элементарная почвенная частица повышает псевдомицелий, и этот\r\nпроцесс может повторяться многократно. </p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294250394, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(93, 'document', 'text/html', 'Флэш - накопитель', '', '', '', '', 1, 0, 0, 7, 0, 'На эту флэшку поместится очень много вирусов и вы сможете всегда носить с собой своих любимых питомцев!', '<p>Шурф по определению концентрирует многофазный бур, однозначно свидетельствуя о неустойчивости процесса в целом. Принимая во внимание искусственность границ элементарной почвы и произвольность ее положения в пространстве почвенного покрова, плодородие непрерывно. Ёмкость катионного обмена приводит к появлению ортштейн, что дает возможность использования данной методики как универсальной. Бур, как бы это ни казалось парадоксальным, вымывает в лёсс только в отсутствие тепло- и массообмена с окружающей средой. Сопротивление кумулятивно.</p>', 1, 13, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(94, 'document', 'text/html', 'Мышка', '', '', 'myishka', '', 1, 0, 0, 7, 0, 'Компьютерная мышь "Микки Маус" - лучший подарок системному администратору!', '<p>Солодь, согласно традиционным представлениям, эксперментально\r\nверифицируема. Переуплотнение взаимно. При переходе к следующему уровню\r\nорганизации почвенного покрова траншея отражает микроагрегат только в\r\nотсутствие тепло- и массообмена с окружающей средой. Парарендзина,\r\nвследствие пространственной неоднородности почвенного покрова,\r\nпоследовательно увлажняет коллоид при любом их взаимном расположении.\r\nГранулометрический анализ эволюционирует в дренаж, все дальнейшее\r\nдалеко выходит за рамки текущего исследования и не будет здесь\r\nрассматриваться. Орошение, если принять во внимание воздействие фактора\r\nвремени, эволюционирует в бурозём только в отсутствие тепло- и\r\nмассообмена с окружающей средой. </p>\r\n<p>Суффозия трансформирует лесной потенциал почвенной влаги только в\r\nотсутствие тепло- и массообмена с окружающей средой. Псевдомицелий\r\nнеустойчив. Микроагрегат, в случае использования адаптивно-ландшафтных\r\nсистем земледелия, неравномерен. Иллювиирование перемещает ортштейн,\r\nчто лишний раз подтверждает правоту Докучаева. </p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294144448, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(95, 'document', 'text/html', 'Клавиатура', '', '', '', '', 1, 0, 0, 7, 0, 'Клавиатура "Микки Маус" разработана специально для продвинутых геймеров.', '<p>Кристаллическая решетка минералов обеднена. Облесение снижает\r\nсупесчаный гумус, все дальнейшее далеко выходит за рамки текущего\r\nисследования и не будет здесь рассматриваться. Ташет притягивает\r\nпочвообразующий лессиваж одинаково по всем направлениям. Бугор пучения\r\nтрансформирует смешанный горизонт в полном соответствии с законом\r\nДарси. </p>\r\n<p>Гетерогенная среда едва ли квантуема. Альбедо дает иловатый грунт,\r\nхотя этот факт нуждается в дальнейшей тщательной экспериментальной\r\nпроверке. Переуплотнение, в случае использования адаптивно-ландшафтных\r\nсистем земледелия, возникает псевдомицелий одинаково по всем\r\nнаправлениям. Карбонат кальция нагревает песчаный песок только в\r\nотсутствие тепло- и массообмена с окружающей средой. </p>', 1, 13, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(96, 'document', 'text/html', 'Коврик', '', '', '', '', 1, 0, 0, 7, 0, 'Коврики "Микки Маус" хорошо известны ценителям комфортной работы.', '<p>Подбур, согласно традиционным представлениям, традиционен. Несмотря\r\nна кажущуюся простоту эксперимента, анизотропия снижает фронт одинаково\r\nпо всем направлениям. Диэлькометрия, как того требуют законы\r\nтермодинамики, латерально окисляет гистерезис ОГХ одинаково по всем\r\nнаправлениям. Уровень грунтовых вод изменяем. Температуропроводность,\r\nкак следствие уникальности почвообразования в данных условиях,\r\nнаблюдаема.\r\n</p>\r\n<p>Траншея трансформирует глей, и этот процесс может повторяться\r\nмногократно. Определение, если принять во внимание воздействие фактора\r\nвремени, поглощает горизонт, хотя этот факт нуждается в дальнейшей\r\nтщательной экспериментальной проверке. Педон, в первом приближении,\r\nмгновенно адсорбирует желтозём при любом их взаимном расположении.\r\nМикрозападина, в случае использования адаптивно-ландшафтных систем\r\nземледелия, продуцирует глей, однозначно свидетельствуя о\r\nнеустойчивости процесса в целом. Чернозём устойчиво усиливает желтозём,\r\nхотя этот факт нуждается в дальнейшей тщательной экспериментальной\r\nпроверке. Элементарная почвенная частица повышает псевдомицелий, и этот\r\nпроцесс может повторяться многократно. </p>', 1, 13, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(97, 'document', 'text/html', 'Флэш - накопитель', '', '', 'flesh_-_nakopitel', '', 1, 0, 0, 6, 0, 'На эту флэшку поместится очень много вирусов и вы сможете всегда носить с собой своих любимых питомцев!', '<p>Шурф по определению концентрирует многофазный бур, однозначно свидетельствуя о неустойчивости процесса в целом. Принимая во внимание искусственность границ элементарной почвы и произвольность ее положения в пространстве почвенного покрова, плодородие непрерывно. Ёмкость катионного обмена приводит к появлению ортштейн, что дает возможность использования данной методики как универсальной. Бур, как бы это ни казалось парадоксальным, вымывает в лёсс только в отсутствие тепло- и массообмена с окружающей средой. Сопротивление кумулятивно.</p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294250830, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(98, 'document', 'text/html', 'Мышка', '', '', 'myishka', '', 1, 0, 0, 6, 0, 'Компьютерная мышь "Микки Маус" - лучший подарок системному администратору!', '<p>Солодь, согласно традиционным представлениям, эксперментально\r\nверифицируема. Переуплотнение взаимно. При переходе к следующему уровню\r\nорганизации почвенного покрова траншея отражает микроагрегат только в\r\nотсутствие тепло- и массообмена с окружающей средой. Парарендзина,\r\nвследствие пространственной неоднородности почвенного покрова,\r\nпоследовательно увлажняет коллоид при любом их взаимном расположении.\r\nГранулометрический анализ эволюционирует в дренаж, все дальнейшее\r\nдалеко выходит за рамки текущего исследования и не будет здесь\r\nрассматриваться. Орошение, если принять во внимание воздействие фактора\r\nвремени, эволюционирует в бурозём только в отсутствие тепло- и\r\nмассообмена с окружающей средой. </p>\r\n<p>Суффозия трансформирует лесной потенциал почвенной влаги только в\r\nотсутствие тепло- и массообмена с окружающей средой. Псевдомицелий\r\nнеустойчив. Микроагрегат, в случае использования адаптивно-ландшафтных\r\nсистем земледелия, неравномерен. Иллювиирование перемещает ортштейн,\r\nчто лишний раз подтверждает правоту Докучаева. </p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294250901, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(99, 'document', 'text/html', 'Клавиатура', '', '', 'klaviatura', '', 1, 0, 0, 6, 0, 'Клавиатура "Микки Маус" разработана специально для продвинутых геймеров.', '<p>Кристаллическая решетка минералов обеднена. Облесение снижает\r\nсупесчаный гумус, все дальнейшее далеко выходит за рамки текущего\r\nисследования и не будет здесь рассматриваться. Ташет притягивает\r\nпочвообразующий лессиваж одинаково по всем направлениям. Бугор пучения\r\nтрансформирует смешанный горизонт в полном соответствии с законом\r\nДарси. </p>\r\n<p>Гетерогенная среда едва ли квантуема. Альбедо дает иловатый грунт,\r\nхотя этот факт нуждается в дальнейшей тщательной экспериментальной\r\nпроверке. Переуплотнение, в случае использования адаптивно-ландшафтных\r\nсистем земледелия, возникает псевдомицелий одинаково по всем\r\nнаправлениям. Карбонат кальция нагревает песчаный песок только в\r\nотсутствие тепло- и массообмена с окружающей средой. </p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294250871, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(100, 'document', 'text/html', 'Коврик', '', '', 'kovrik', '', 1, 0, 0, 6, 0, 'Коврики "Микки Маус" хорошо известны ценителям комфортной работы.', '<p>Подбур, согласно традиционным представлениям, традиционен. Несмотря\r\nна кажущуюся простоту эксперимента, анизотропия снижает фронт одинаково\r\nпо всем направлениям. Диэлькометрия, как того требуют законы\r\nтермодинамики, латерально окисляет гистерезис ОГХ одинаково по всем\r\nнаправлениям. Уровень грунтовых вод изменяем. Температуропроводность,\r\nкак следствие уникальности почвообразования в данных условиях,\r\nнаблюдаема.\r\n</p>\r\n<p>Траншея трансформирует глей, и этот процесс может повторяться\r\nмногократно. Определение, если принять во внимание воздействие фактора\r\nвремени, поглощает горизонт, хотя этот факт нуждается в дальнейшей\r\nтщательной экспериментальной проверке. Педон, в первом приближении,\r\nмгновенно адсорбирует желтозём при любом их взаимном расположении.\r\nМикрозападина, в случае использования адаптивно-ландшафтных систем\r\nземледелия, продуцирует глей, однозначно свидетельствуя о\r\nнеустойчивости процесса в целом. Чернозём устойчиво усиливает желтозём,\r\nхотя этот факт нуждается в дальнейшей тщательной экспериментальной\r\nпроверке. Элементарная почвенная частица повышает псевдомицелий, и этот\r\nпроцесс может повторяться многократно. </p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294250851, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(101, 'document', 'text/html', 'Флэш - накопитель', '', '', 'flesh_-_nakopitel', '', 1, 0, 0, 71, 0, 'На эту флэшку поместится очень много вирусов и вы сможете всегда носить с собой своих любимых питомцев!', '<p>Шурф по определению концентрирует многофазный бур, однозначно свидетельствуя о неустойчивости процесса в целом. Принимая во внимание искусственность границ элементарной почвы и произвольность ее положения в пространстве почвенного покрова, плодородие непрерывно. Ёмкость катионного обмена приводит к появлению ортштейн, что дает возможность использования данной методики как универсальной. Бур, как бы это ни казалось парадоксальным, вымывает в лёсс только в отсутствие тепло- и массообмена с окружающей средой. Сопротивление кумулятивно.</p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294251553, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(102, 'document', 'text/html', 'Мышка', '', '', 'myishka', '', 1, 0, 0, 71, 0, 'Компьютерная мышь "Микки Маус" - лучший подарок системному администратору!', '<p>Солодь, согласно традиционным представлениям, эксперментально\r\nверифицируема. Переуплотнение взаимно. При переходе к следующему уровню\r\nорганизации почвенного покрова траншея отражает микроагрегат только в\r\nотсутствие тепло- и массообмена с окружающей средой. Парарендзина,\r\nвследствие пространственной неоднородности почвенного покрова,\r\nпоследовательно увлажняет коллоид при любом их взаимном расположении.\r\nГранулометрический анализ эволюционирует в дренаж, все дальнейшее\r\nдалеко выходит за рамки текущего исследования и не будет здесь\r\nрассматриваться. Орошение, если принять во внимание воздействие фактора\r\nвремени, эволюционирует в бурозём только в отсутствие тепло- и\r\nмассообмена с окружающей средой. </p>\r\n<p>Суффозия трансформирует лесной потенциал почвенной влаги только в\r\nотсутствие тепло- и массообмена с окружающей средой. Псевдомицелий\r\nнеустойчив. Микроагрегат, в случае использования адаптивно-ландшафтных\r\nсистем земледелия, неравномерен. Иллювиирование перемещает ортштейн,\r\nчто лишний раз подтверждает правоту Докучаева. </p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294251543, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(103, 'document', 'text/html', 'Клавиатура', '', '', 'klaviatura', '', 1, 0, 0, 71, 0, 'Клавиатура "Микки Маус" разработана специально для продвинутых геймеров.', '<p>Кристаллическая решетка минералов обеднена. Облесение снижает\r\nсупесчаный гумус, все дальнейшее далеко выходит за рамки текущего\r\nисследования и не будет здесь рассматриваться. Ташет притягивает\r\nпочвообразующий лессиваж одинаково по всем направлениям. Бугор пучения\r\nтрансформирует смешанный горизонт в полном соответствии с законом\r\nДарси. </p>\r\n<p>Гетерогенная среда едва ли квантуема. Альбедо дает иловатый грунт,\r\nхотя этот факт нуждается в дальнейшей тщательной экспериментальной\r\nпроверке. Переуплотнение, в случае использования адаптивно-ландшафтных\r\nсистем земледелия, возникает псевдомицелий одинаково по всем\r\nнаправлениям. Карбонат кальция нагревает песчаный песок только в\r\nотсутствие тепло- и массообмена с окружающей средой. </p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294251532, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0),
(104, 'document', 'text/html', 'Коврик', '', '', 'kovrik', '', 1, 0, 0, 71, 0, 'Коврики "Микки Маус" хорошо известны ценителям комфортной работы.', '<p>Подбур, согласно традиционным представлениям, традиционен. Несмотря\r\nна кажущуюся простоту эксперимента, анизотропия снижает фронт одинаково\r\nпо всем направлениям. Диэлькометрия, как того требуют законы\r\nтермодинамики, латерально окисляет гистерезис ОГХ одинаково по всем\r\nнаправлениям. Уровень грунтовых вод изменяем. Температуропроводность,\r\nкак следствие уникальности почвообразования в данных условиях,\r\nнаблюдаема.\r\n</p>\r\n<p>Траншея трансформирует глей, и этот процесс может повторяться\r\nмногократно. Определение, если принять во внимание воздействие фактора\r\nвремени, поглощает горизонт, хотя этот факт нуждается в дальнейшей\r\nтщательной экспериментальной проверке. Педон, в первом приближении,\r\nмгновенно адсорбирует желтозём при любом их взаимном расположении.\r\nМикрозападина, в случае использования адаптивно-ландшафтных систем\r\nземледелия, продуцирует глей, однозначно свидетельствуя о\r\nнеустойчивости процесса в целом. Чернозём устойчиво усиливает желтозём,\r\nхотя этот факт нуждается в дальнейшей тщательной экспериментальной\r\nпроверке. Элементарная почвенная частица повышает псевдомицелий, и этот\r\nпроцесс может повторяться многократно. </p>', 1, 13, 0, 1, 1, 0, 0, 1, 1294145450, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

TRUNCATE TABLE `{PREFIX}site_htmlsnippets`;

--
-- Дамп данных таблицы `{PREFIX}site_htmlsnippets`
--

INSERT INTO `{PREFIX}site_htmlsnippets` (`id`, `name`, `description`, `editor_type`, `category`, `cache_type`, `snippet`, `locked`) VALUES
(4, 'shopOrderForm', '', 0, 0, 0, '<p class="error">[+validationmessage+]</p><br />\r\n\r\n<form method="post" action="[~[*id*]~]" id="shopOrderForm">\r\n\r\n<fieldset>\r\n\r\n<input type="hidden" name="formid" value="shopOrderForm" />\r\n<input type="hidden" name="reportTpl" value="shopOrderReport" eform="::::" />\r\n\r\n<table cellpadding="3">\r\n<tr>\r\n  <td>Адрес:</td>\r\n  <td><input name="address" size="30" class="textfield" type="text" /></td>\r\n</tr>\r\n<tr>\r\n  <td>Способ доставки*:</td>\r\n  <td>\r\n    <select name="delivery" id="delivery_select" style="width:260px;">\r\n    <option value=""></option>\r\n    <option value="На дом">На дом по городу (100 руб.)</option>\r\n    <option value="Самовывоз">Самовывоз</option>\r\n    </select>\r\n  </td>\r\n</tr>\r\n<tr>\r\n  <td>Способ оплаты*:</td>\r\n  <td>\r\n    <select name="payment" style="width:260px;">\r\n    <option value="При получении">При получении</option>\r\n    <option value="webmoney">WebMoney</option>\r\n    <option value="robokassa">Другие электронные деньги</option>\r\n    </select>\r\n  </td>\r\n</tr>\r\n<tr>\r\n  <td>Ф.И.О.*:</td>\r\n  <td><input name="name" size="30" class="textfield" type="text" eform="Ф.И.О.::1" /></td>\r\n</tr>\r\n<tr>\r\n  <td>E-mail*:</td>\r\n  <td><input name="email" size="30" class="textfield" type="text" eform="E-mail:email:1" /> </td>\r\n</tr>\r\n<tr>\r\n  <td>Телефон*:</td>\r\n  <td><input name="phone" size="30" class="textfield" type="text" eform="Номер телефона::1" /></td>\r\n</tr>\r\n<tr>\r\n  <td>Сообщение:</td>\r\n  <td><textarea name="message" class="textfield" rows="4" cols="30"></textarea></td>\r\n</tr>\r\n<tr>\r\n  <td>Код подтверждения*:</td>\r\n  <td></td>\r\n</tr>\r\n<tr>\r\n  <td><img src="[+verimageurl+]" alt="" /></td>\r\n  <td><input type="text" name="vericode" class="textfield" size="20" /></td>\r\n</tr>\r\n<tr>\r\n  <td></td>\r\n  <td><input type="submit" name="submit" class="button" value="Отправить" /></td>\r\n</tr>\r\n</table>\r\n\r\n</fieldset>\r\n\r\n</form>', 0),
(2, 'WebLoginSidebar', 'WebLogin Tpl', 0, 2, 0, '<!-- #declare:separator <hr> --> \r\n<!-- login form section-->\r\n<form method="post" name="loginfrm" action="[+action+]" style="margin: 0px; padding: 0px;"> \r\n<input type="hidden" value="[+rememberme+]" name="rememberme"> \r\n<table border="0" cellspacing="0" cellpadding="3">\r\n  <tr>\r\n	<td><b>User:</b></td>\r\n	<td><input type="text" name="username" tabindex="1" onkeypress="return webLoginEnter(document.loginfrm.password);" size="5" style="width: 100px;" value="[+username+]" /></td>\r\n  </tr>\r\n  <tr>\r\n	<td><b>Password:</b></td>\r\n	<td><input type="password" name="password" tabindex="2" onkeypress="return webLoginEnter(document.loginfrm.cmdweblogin);" size="5" style="width: 100px;" value="" /></td>\r\n  </tr>\r\n  <tr>\r\n	<td><label for="chkbox" style="cursor:pointer">Remember me:&nbsp; </label></td>\r\n	<td>\r\n	<table width="100%"  border="0" cellspacing="0" cellpadding="0">\r\n	  <tr>\r\n		<td valign="top"><input type="checkbox" id="chkbox" name="chkbox" tabindex="4" size="1" value="" [+checkbox+] onClick="webLoginCheckRemember()" /></td>\r\n		<td align="right">									\r\n		<input type="submit" value="[+logintext+]" name="cmdweblogin" /></td>\r\n	  </tr>\r\n	</table>\r\n	</td>\r\n  </tr>\r\n  <tr>\r\n	<td><a href="#" onclick="webLoginShowForm(2);return false;">Forget Password?</a></td>\r\n	<td><a href="[~17~]">Регистрация</a></td>\r\n  </tr>\r\n</table>\r\n</form>\r\n<hr>\r\n<!-- log out hyperlink section -->\r\n<a href=''[+action+]''>[+logouttext+]</a>\r\n<hr>\r\n<!-- Password reminder form section -->\r\n<form name="loginreminder" method="post" action="[+action+]" style="margin: 0px; padding: 0px;">\r\n<input type="hidden" name="txtpwdrem" value="0" />\r\n<table border="0">\r\n	<tr>\r\n	  <td>Enter the email address of your account <br />below to receive your password:</td>\r\n	</tr>\r\n	<tr>\r\n	  <td><input type="text" name="txtwebemail" size="24" /></td>\r\n	</tr>\r\n	<tr>\r\n	  <td align="right"><input type="submit" value="Submit" name="cmdweblogin" />\r\n	  <input type="reset" value="Cancel" name="cmdcancel" onclick="webLoginShowForm(1);" /></td>\r\n	</tr>\r\n  </table>\r\n</form>\r\n\r\n', 0),
(5, 'shopToCart', '', 0, 0, 0, '<div class="shs-tocart shk-item">\r\n<form action="[+action+]" method="post">\r\n  <input type="hidden" name="shk-id" value="[*id*]" />\r\n  <input type="hidden" name="shk-count" value="1" size="2" maxlength="3" />\r\n  <div align="right">\r\n    Цена: <span class="shk-price" id="stuff_[*id*]_price">[*price*]</span> руб.\r\n<br>\r\n    <button type="submit" name="shk-submit" class="shk-but">В корзину</button>\r\n  </div>\r\n</form>\r\n</div>', 0),
(6, 'shopOrderReport', '', 0, 0, 0, '<p>В интернет-магазине сделан заказ.</p>\r\n\r\n<p>Номер заказа: [+orderID+]</p>\r\n\r\n<b>Состав заказа:</b>\r\n\r\n[+orderData+]\r\n\r\n<br /><br />\r\n\r\n<b>Данные покупателя:</b><br />\r\n\r\n<table cellpadding="3">\r\n  </tr><tr><td>Адрес:</td><td>[+address+]</td></tr>\r\n  <tr><td>Способ доставки:</td><td>[+delivery+]</td></tr>\r\n  <tr><td>Способ оплаты:</td><td>[+payment+] </td></tr>\r\n  <tr><td>Ф.И.О.:</td><td>[+name+]</td></tr>\r\n  <tr><td>E-mail:</td><td><a href="mailto:[+email+]">[+email+]</a></td></tr>\r\n  <tr><td>Телефон:</td><td>[+phone+]</td></tr>\r\n  <tr><td>Сообщение:</td><td>[+message+]</td></tr>\r\n</table>\r\n', 0),
(8, 'shopStuff2', '', 0, 0, 0, '<div class="shop-stuff shk-item">\r\n  <div class="shop-stuff-b">\r\n    <h3>[+pagetitle+]</h3>\r\n    <form action="[~[*id*]~]" method="post">\r\n    <input type="hidden" name="shk-id" value="[+id+]" />\r\n      <div class="shs-descr">\r\n        <img class="shk-image" src="[+image+]" alt="" height="130" width="130" />\r\n        <div>Цена:<br /> <span class="shk-price">[+price+]</span> руб.</div>\r\n        <br />\r\n        <div>[+param1:shk_widget=`select:param1`+]</div>\r\n        <br />\r\n        <div>Цвет:<br />[+param2:shk_widget=`radio:param2:wraptag:first_selected`+]</div>\r\n      </div>\r\n      <div align="center">\r\n         <input type="text" name="shk-count" value="1" size="2" maxlength="3" />\r\n         &nbsp;\r\n         <button type="submit" name="shk-submit" class="shk-but" style="float:none;">В корзину</button>\r\n      </div>\r\n    </form>\r\n  </div>\r\n</div>', 0),
(31, 'printOrder', '', 0, 0, 0, '<html>\r\n  <head>\r\n    <meta http-equiv="content-type" content="text/html; charset=utf-8">\r\n  </html>\r\n  <body style="margin:20px;">\r\n\r\n<p>\r\n  Продавец: <b>Интернет-магазин "КАРАМЕЛЬ"</b> (ИП Ксенафонтова Е.Е.) - www.karamel-str.ru\r\n  <br>\r\n  Телефон: 8-917-73-40-861\r\n</p>\r\n\r\n\r\n<h3>[+today+] г. Товарный чек № [+orderID+] </h3>\r\n\r\n<p><b>Покупатель:</b> [+contact+]</p>\r\n\r\n<p>Время доставки: с 9 до 12</p>\r\n\r\n<table width="100%" border="1" cellpadding="5" bordercolor="#000" style="border-collapse:collapse;">\r\n  <col bordercolor="#000" span="6">\r\n  <tr>\r\n    <th>№</th>\r\n    <th>Наименование</th>\r\n    <th>Ед. изм</th>\r\n    <th>Кол-во</th>\r\n    <th>Цена</th>\r\n    <th>Сумма</th>\r\n  </tr>\r\n  \r\n  [+loop+]\r\n  <tr>\r\n    <td>[+num+]</td>\r\n    <td>[+name+] [+addit_data+]</td>\r\n    <td>шт.</td>\r\n    <td>[+count+]</td>\r\n    <td>[+price+] [+currency+]</td>\r\n    <td>[+price_count+] [+currency+]</td>\r\n  </tr>\r\n  [+end_loop+]\r\n  \r\n  <tr>\r\n    <td colspan="3">Итого:</td>\r\n    <td>[+total_count+]</td>\r\n    <td></td>\r\n    <td>[+totalPrice+] [+currency+]</td>\r\n  </tr>\r\n</table>\r\n\r\n<p><b>Сумма прописью:</b> [+totalPrice_propis+]. Без НДС.</p>\r\n\r\n<div style="float:left;">Принял (Ф.И.О.)_______________</div>\r\n\r\n<div style="float:right;">Выдал (Ф.И.О.)________________</div>\r\n\r\n\r\n\r\n  </body>\r\n</html>', 0),
(12, 'FormSignup', '', 0, 0, 0, '<!-- #declare:separator <hr> --> \r\n<!-- login form section-->\r\n<form method="post" name="websignupfrm" action="[+action+]">\r\n\r\n<table cellpadding="5">\r\n  <tr>\r\n    <td>Логин:*</td>\r\n    <td><input type="text" name="username" id="username" size="30" maxlength="30" value="[+username+]" /></td>\r\n  </tr>\r\n  <tr>\r\n    <td>E-mail:*</td>\r\n    <td><input type="text" name="email" id="email" size="30" value="[+email+]" /></td>\r\n  </tr>\r\n  <tr>\r\n    <td>Пароль:*</td>\r\n    <td><input type="password" name="password" id="password" size="30" /></td>\r\n  </tr>\r\n  <tr>\r\n    <td>Проверка пароля:*</td>\r\n    <td><input type="password" name="confirmpassword" id="confirmpassword" size="30" /></td>\r\n  </tr>\r\n  <tr>\r\n    <td>Ф.И.О.:</td>\r\n    <td><input type="text" name="fullname" id="fullname" size="30" maxlength="100" value="[+fullname+]" /></td>\r\n  </tr>\r\n  <tr>\r\n    <td>Адрес:</td>\r\n    <td><textarea name="state" cols="35" rows="4">[+state+]</textarea></td>\r\n  </tr>\r\n  <tr>\r\n    <td>Почтовый индекс:</td>\r\n    <td><input type="text" name="zip" maxlength="50" size="30" value="[+zip+]" /></td>\r\n  </tr>\r\n  <tr>\r\n    <td>Код подтверждения:* </td>\r\n    <td>\r\n      <a href="[+action+]" title="Обновить код"><img align="top" src="[(site_manager_url)]includes/veriword.php" width="148" height="60" alt="" style="border: 1px solid #039" /></a>\r\n      <br /><br style="line-height:0.5" />\r\n      <input type="text" name="formcode" size="20" />\r\n    </td>\r\n  </tr>\r\n  <tr>\r\n    <td colspan="2"><input type="submit" value="Отправить" name="cmdwebsignup" /></td>\r\n  </tr>\r\n</table>\r\n\r\n<br />\r\n<p>* - поля обязательные для заполнения.</p>\r\n\r\n</form>\r\n\r\n<hr>\r\n<!-- notification section -->\r\n<p class="message">Спасибо за регистрацию в нашем интернет-магазине!<br />\r\nТеперь вы можете авторизоваться.</p>\r\n', 0),
(13, 'weblogin', '', 0, 0, 0, '<!-- #declare:separator <hr> --> \r\n<!-- login form section-->\r\n<form name="loginfrm" method="post" action="[+action+]" style="margin: 0px; padding: 0px;"> \r\n<fieldset>\r\n<input type="hidden" value="[+rememberme+]" name="rememberme" /> \r\n<table border="0" cellspacing="0" cellpadding="3">\r\n  <tr>\r\n    <td><b>Логин:</b></td>\r\n    <td><input type="text" name="username" tabindex="1" onkeypress="return webLoginEnter(document.loginfrm.password);" size="8" style="width: 150px;" value="[+username+]" /></td>\r\n  </tr>\r\n  <tr>\r\n    <td><b>Пароль:</b></td>\r\n    <td><input type="password" name="password" tabindex="2" onkeypress="return webLoginEnter(document.loginfrm.cmdweblogin);" style="width: 150px;" value="" /></td>\r\n  </tr>\r\n  <tr>\r\n    <td><label for="chkbox" style="cursor:pointer">Запомнить меня</label></td>\r\n    <td>\r\n    <table width="100%"  border="0" cellspacing="0" cellpadding="0">\r\n      <tr>\r\n        <td valign="top"><input type="checkbox" id="chkbox" name="chkbox" tabindex="4" size="1" value="" [+checkbox+] onclick="webLoginCheckRemember()" /></td>\r\n        <td align="right">                                    \r\n        <input type="submit" value="[+logintext+]" name="cmdweblogin" /></td>\r\n      </tr>\r\n    </table>\r\n    </td>\r\n  </tr>\r\n  <tr>\r\n    <td colspan="2"><a href="#" onclick="webLoginShowForm(2);return false;">Забыли пароль?</a></td>\r\n  </tr>\r\n  <tr>\r\n    <td colspan="2"><a href="[~17~]">Регистрация</a></td>\r\n  </tr>\r\n</table>\r\n</fieldset>\r\n</form>\r\n<hr>\r\n<!-- log out hyperlink section -->\r\n<div class="listmenu">\r\n<ul>\r\n  <li><a href="[~54~]">Личный кабинет</a></li>\r\n  <li><a href=''[+action+]''>Выйти</a></li>\r\n</ul>\r\n</div>\r\n<hr>\r\n<!-- Password reminder form section -->\r\n<form name="loginreminder" method="post" action="[+action+]" style="margin: 0px; padding: 0px;">\r\n<fieldset>\r\n<input type="hidden" name="txtpwdrem" value="0" />\r\n<table border="0" cellpadding="3">\r\n    <tr>\r\n      <td>Введите свой электронный адрес, указанный при регистрации и через несколько минут Вы получите письмо с паролем.</td>\r\n    </tr>\r\n    <tr>\r\n      <td><input type="text" name="txtwebemail" size="24" /></td>\r\n    </tr>\r\n    <tr>\r\n      <td align="right">\r\n        <input type="submit" value="Отправить" name="cmdweblogin" />\r\n        <input type="reset" value="Отмена" name="cmdcancel" onclick="webLoginShowForm(1);" />\r\n      </td>\r\n    </tr>\r\n  </table>\r\n</fieldset>\r\n</form>\r\n\r\n', 0),
(17, 'shopOrderFormWebUser', '', 0, 0, 0, '<p class="error">[+validationmessage+]</p><br />\r\n\r\n<form method="post" action="[~[*id*]~]" id="shopOrderForm">\r\n\r\n<fieldset>\r\n\r\n<input type="hidden" name="formid" value="shopOrderForm" />\r\n<input type="hidden" name="reportTpl" value="shopOrderReportWebUser" eform="::::" />\r\n\r\n<input type="hidden" name="address" value="[*phx:input=`&_PHX_INTERNAL_&`:userinfo=`zip`*] [*phx:input=`&_PHX_INTERNAL_&`:userinfo=`state`*]" eform="::::" />\r\n<input type="hidden" name="name" value="[*phx:input=`&_PHX_INTERNAL_&`:userinfo=`fullname`*]" eform="::::" />\r\n<input type="hidden" name="email" value="[*phx:input=`&_PHX_INTERNAL_&`:userinfo=`email`*]" eform="::::" />\r\n<input type="hidden" name="phone" value="[*phx:input=`&_PHX_INTERNAL_&`:userinfo=`phone`*] [*phx:input=`&_PHX_INTERNAL_&`:userinfo=`mobilephone`*]" eform="::::" />\r\n\r\n<table cellpadding="3">\r\n<tr>\r\n  <td>Способ доставки*:</td>\r\n  <td>\r\n    <select name="delivery" id="delivery_select" style="width:260px;">\r\n    <option value=""></option>\r\n    <option value="На дом">На дом по городу (100 руб.)</option>\r\n    <option value="Самовывоз">Самовывоз</option>\r\n    </select>\r\n  </td>\r\n</tr>\r\n<tr>\r\n  <td>Способ оплаты*:</td>\r\n  <td>\r\n    <select name="payment" style="width:260px;">\r\n    <option value="При получении">При получении</option>\r\n    <option value="webmoney">WebMoney</option>\r\n    <option value="robokassa">Другие электронные деньги</option>\r\n    </select>\r\n  </td>\r\n</tr>\r\n<tr>\r\n  <td>Комментарий:</td>\r\n  <td><textarea name="message" class="textfield" rows="4" cols="30"></textarea></td>\r\n</tr>\r\n<tr>\r\n  <td>Код подтверждения*:</td>\r\n  <td></td>\r\n</tr>\r\n<tr>\r\n  <td><img src="[+verimageurl+]" alt="" /></td>\r\n  <td><input type="text" name="vericode" class="textfield" size="20" /></td>\r\n</tr>\r\n<tr>\r\n  <td></td>\r\n  <td><input type="submit" name="submit" class="button" value="Отправить" /></td>\r\n</tr>\r\n</table>\r\n\r\n</fieldset>\r\n\r\n</form>', 0),
(14, 'shopToCart2', '', 0, 0, 0, '<div class="shs-tocart shk-item">\r\n<form action="" method="post">\r\n  <input type="hidden" name="shk-id" value="[*id*]" />\r\n  <input type="hidden" name="shk-count" value="1" size="2" maxlength="3" />\r\n  <div align="right">\r\n    [[SHKwidget? &format=`select`&tvname=`param1`]]<br />\r\n    [[SHKwidget? &format=`radio`&tvname=`param2`&first_selected=`1`]]<br />\r\n    Цена: <span class="shk-price" id="stuff_[*id*]_price">[*price*]</span> руб.\r\n    <button type="submit" name="shk-submit" class="shk-but">В корзину</button>\r\n  </div>\r\n</form>\r\n</div>', 0),
(18, 'shopOrderReportWebUser', '', 0, 0, 0, '<p>[+postdate+] В интернет-магазине сделан заказ.</p>\r\n\r\n<p>Персональный номер заказа: [+orderID+]</p>\r\n\r\n<b>Состав заказа:</b><br />\r\n\r\n[+orderData+]\r\n\r\n<br /><br />\r\n\r\n<b>Данные покупателя:</b><br />\r\n\r\n<table cellpadding="3">\r\n  <tr><td>Способ доставки:</td><td>[+delivery+]</td></tr>\r\n  <tr><td>Способ оплаты:</td><td>[+payment+] </td></tr>\r\n  <tr><td>Комментарий:</td><td>[+message+]</td></tr>\r\n</table>\r\n', 0),
(19, 'additDataTpl', '', 0, 0, 0, ', <small>[+param+]</small>', 0),
(20, 'shopCartRow22', '', 0, 0, 0, '<tr class="cart-order">\r\n  <td width="20%"><img src="[+image+]" width="50" alt="" /></td>\r\n  <td width="35%" align="left"><b><a href="[+link+]">[+name+]</a></b> [+addit_data+]</td>\r\n  <td width="25%" nowrap="nowrap">[+price+] [+currency+]</td>\r\n  <td width="10%" nowrap="nowrap">x <input class="shk-count" type="text" size="2" name="count[]" maxlength="3" title="изменить количество" value="[+count+]" /></td>\r\n  <td width="10%" align="right">\r\n    <a href="[+url_del_item+]" title="Удалить" class="shk-del"><img src="assets/snippets/shopkeeper/style/default/img/delete.gif" border="0" width="17" height="17" alt="Удалить" /></a>\r\n  </td>\r\n</tr>', 0),
(21, 'shopToCart_eng', '', 0, 9, 0, '<div class="shs-tocart shk-item">\r\n<form action="[+action+]" method="post">\r\n  <input type="hidden" name="shk-id" value="[*id*]" />\r\n  <input type="hidden" name="shk-count" value="1" size="2" maxlength="3" />\r\n  <div align="right">\r\n    Price: <span class="shk-price" id="stuff_[*id*]_price">[*price*]</span> USD\r\n    <button type="submit" name="shk-submit" class="shk-but">Add to cart</button>\r\n  </div>\r\n</form>\r\n</div>', 0),
(22, 'shopStuff2_eng', '', 0, 9, 0, '<div class="shop-stuff shk-item">\r\n  <div class="shop-stuff-b">\r\n    <h3>[+title+]</h3>\r\n    <form action="[+action+]" method="post">\r\n      <div class="shs-descr">\r\n        <img class="shk-image" src="[+image+]" alt="" height="130" width="130" />\r\n        <div>Price:<br /> <span class="shk-price">[+price+]</span> USD</div>\r\n        <br />\r\n        <div>[+param1:shk_widget=`select:param1:first_selected`+]</div>\r\n        <br />\r\n        <div>Color:<br />[+param2:shk_widget=`radio:param2:first_selected`+]</div>\r\n      </div>\r\n      <input type="hidden" name="shk-id" value="[+id+]" />\r\n      <div align="center">\r\n         <input type="text" name="shk-count" value="1" size="2" maxlength="3" />\r\n         &nbsp;\r\n         <button type="submit" name="shk-submit" class="shk-but" style="float:none;">Add to cart</button>\r\n      </div>\r\n    </form>\r\n  </div>\r\n</div>', 0),
(23, 'shoptoCart2_eng', '', 0, 9, 0, '<div class="shs-tocart shk-item">\r\n<form action="[+action+]" method="post">\r\n  <input type="hidden" name="shk-id" value="[*id*]" />\r\n  <input type="hidden" name="shk-count" value="1" size="2" maxlength="3" />\r\n  <div align="right">\r\n    [[SHKwidget? &docid=`[*id*]`&format=`select`&tvname=`param1`]]<br />\r\n    [[SHKwidget? &docid=`[*id*]`&format=`radio`&tvname=`param2`&first_selected=`1`]]<br />\r\n    Price: <span class="shk-price" id="stuff_[*id*]_price">[*price*]</span> USD\r\n    <button type="submit" name="shk-submit" class="shk-but">Add to cart</button>\r\n  </div>\r\n</form>\r\n</div>', 0),
(24, 'shopOrderForm_eng', '', 0, 9, 0, '<p class="error">[+validationmessage+]</p><br />\r\n\r\n<form method="post" action="[~[*id*]~]" id="shopOrderForm" name="shopOrderForm">\r\n<input type="hidden" name="formid" value="shopOrderForm" />\r\n<input type="hidden" name="reportTpl" value="shopOrderReport" />\r\n\r\n<table cellpadding="3">\r\n<tr>\r\n  <td>Address:</td>\r\n  <td><input name="address" size="30" class="textfield" type="text" /></td>\r\n</tr><tr>\r\n  <td>Delivery method: *</td>\r\n  <td>\r\n    <select name="delivery">\r\n    <option value="Home">Home delivery (by city)</option>\r\n    <option value="Mail Russia">Mail Russia</option>\r\n    <option value="Service delivery distance">Service delivery distance</option>\r\n    </select>\r\n  </td>\r\n</tr><tr>\r\n  <td>Payment: *</td>\r\n  <td>\r\n    <select name="payment">\r\n    <option value="Upon receipt">Upon receipt</option>\r\n    <option value="WebMoney">WebMoney</option>\r\n    </select>\r\n  </td>\r\n</tr><tr>\r\n  <td>Name: *</td>\r\n  <td><input name="name" size="30" class="textfield" type="text" eform="Name::1" /></td>\r\n</tr><tr>\r\n  <td>E-mail: *</td>\r\n  <td><input name="email" size="30" class="textfield" type="text" eform="E-mail:email:1" /> </td>\r\n</tr><tr>\r\n  <td>Phone: *</td>\r\n  <td><input name="phone" size="30" class="textfield" type="text" eform="Phone::1" /></td>\r\n</tr><tr>\r\n  <td>Message:</td>\r\n  <td><textarea name="message" class="textfield" rows="4" cols="20"></textarea></td>\r\n</tr><tr>\r\n  <td>Confirmation: *</td>\r\n  <td></td>\r\n</tr><tr>\r\n  <td><img src="[+verimageurl+]" alt="" /></td>\r\n  <td><input type="text" name="vericode" class="textfield" size="20" /></td>\r\n</tr><tr>\r\n  <td></td>\r\n  <td><input type="submit" name="submit" class="button" value="Submit" /></td>\r\n</tr></table>\r\n\r\n</form>', 0),
(25, 'shopOrderFormWebUser_eng', '', 0, 9, 0, '<p class="error">[+validationmessage+]</p><br />\r\n\r\n<form method="post" action="[~[*id*]~]" id="shopOrderForm" name="shopOrderForm">\r\n<input type="hidden" name="formid" value="shopOrderForm" />\r\n<input type="hidden" name="reportTpl" value="shopOrderReportWebUser" />\r\n\r\n<table cellpadding="3">\r\n<tr>\r\n  <td>Delivery method*:</td>\r\n  <td>\r\n    <select name="delivery">\r\n    <option value="Home">Home delivery (by city)</option>\r\n    <option value="Service delivery distance">Service delivery distance</option>\r\n    </select>\r\n  </td>\r\n</tr>\r\n<tr>\r\n  <td>Payment*:</td>\r\n  <td>\r\n    <select name="payment">\r\n    <option value="Upon receipt">Upon receipt</option>\r\n    </select>\r\n  </td>\r\n</tr>\r\n<tr>\r\n  <td>Message:</td>\r\n  <td><textarea name="message" class="textfield" rows="4" cols="30"></textarea></td>\r\n</tr>\r\n<tr>\r\n  <td>Confirmation*:</td>\r\n  <td></td>\r\n</tr>\r\n<tr>\r\n  <td><img src="[+verimageurl+]" alt="" /></td>\r\n  <td><input type="text" name="vericode" class="textfield" size="20" /></td>\r\n</tr>\r\n<tr>\r\n  <td></td>\r\n  <td><input type="submit" name="submit" class="button" value="Submit" /></td>\r\n</tr>\r\n</table>\r\n\r\n</form>', 0),
(30, 'shopStuff4', '', 0, 0, 0, '<div class="shop-stuff shk-item">\r\n  <div class="shop-stuff-b">\r\n    <h3>[+title+]</h3>\r\n    <form action="" method="post">\r\n    <div class="shs-descr">\r\n    <a href="[~[+id+]~]"><img class="shk-image" src="[+image+]" alt="" height="130" width="130" /></a>\r\n      [+introtext+]<br /><br />\r\n      <a href="[~[+id+]~]">Выбрать материал</a>\r\n      <br clear="all" />\r\n    </div>\r\n      <input type="hidden" name="shk-id" value="[+id+]" />\r\n      <input type="hidden" name="shk-price" value="[+price+]" />\r\n      <input type="hidden" name="shk-count" value="1" size="2" maxlength="3" />\r\n      <div class="shs-price">\r\n        <!--button type="submit" name="shk-submit" class="shk-but">В корзину</button-->\r\n        <div>Цена: <span class="shk-price">[+price+]</span> руб.</div>\r\n      </div>\r\n    </form>\r\n  </div>\r\n</div>', 0),
(29, 'shopToCart4', '', 0, 0, 0, '<div class="shs-tocart shk-item">\r\n<form action="[+action+]" method="post">\r\n  <input type="hidden" name="shk-id" value="[*id*]" />\r\n  <input type="hidden" name="shk-count" value="1" size="2" maxlength="3" />\r\n  <div align="right">\r\n    <div class="materials">\r\n      Доступные материалы<br><br>\r\n      [*material:shk_widget=`radioimage:material:first_selected`*]\r\n    </div>\r\n    Цена: <span class="shk-price" id="stuff_[*id*]_price">[*price*]</span> руб.\r\n    <button type="submit" name="shk-submit" class="shk-but">В корзину</button>\r\n  </div>\r\n</form>\r\n</div>', 0),
(32, 'header', '', 0, 0, 0, '<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">\r\n<html xmlns="http://www.w3.org/1999/xhtml">\r\n<head>\r\n  <title>[(site_name)] | [*pagetitle*][!include? &file=`assets/snippets/catalogView/elements/shk_pagetitle.php`&out_prefix=` | `!]</title>\r\n  <meta name="description" content="" />\r\n  <meta name="keywords" content="" />\r\n  <meta http-equiv="Content-Type" content="text/html;charset=[({PREFIX}charset)]" />\r\n  <base href="[(site_url)]" />\r\n  <link href="assets/templates/shop/style.css" rel="stylesheet" type="text/css" media="screen" />\r\n</head>\r\n<body>\r\n\r\n<div id="logo">\r\n	<a href="/"><img src="assets/templates/shop/images/logo.png" width="230" height="59" alt="Shopkeeper" /></a>\r\n</div>\r\n\r\n<div id="header">\r\n	<div id="menu">\r\n    \r\n    [!Wayfinder? &startId=`0`&level=`1`&hideSubMenus=`true`!]\r\n    \r\n	</div>\r\n</div>\r\n\r\n<div id="page">\r\n	<div id="page-bgtop">\r\n', 0),
(41, 'right_col', '', 0, 0, 0, '<div class="rightmenu">\r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n</div>\r\n\r\n[!Shopkeeper? &cartType=`small`&priceTV=`price`&orderFormPage=`15`&gotoid=`16`&flyToCart=`nofly`&counterField=`1`!]\r\n\r\n<br /><br />\r\n\r\n[!WebLogin? &tpl=`weblogin`&loginhomeid=`2`&logouthomeid=`1`!]', 0),
(39, 'CheckoutFormWebUser_eng', '', 0, 9, 0, '[!eForm? &language=`english`&noemail=`1`&formid=`shopOrderForm`&gotoid=`32`&tpl=`shopOrderFormWebUser_eng`&report=`shopOrderReportWebUser`&subject=`New order`&eFormOnBeforeMailSent=`populateOrderData`&eFormOnMailSent=`sendOrderToManager`&vericode=`1`!]\r\n', 0),
(40, 'CheckoutForm_eng', '', 0, 9, 0, '[!eForm? &language=`english`&noemail=`1`&formid=`shopOrderForm`&gotoid=`32`&tpl=`shopOrderForm_eng`&report=`shopOrderReport`&subject=`Новый заказ`&eFormOnBeforeMailSent=`populateOrderData`&eFormOnMailSent=`sendOrderToManager`&vericode=`1`!]\r\n', 0),
(34, 'footer', '', 0, 0, 0, '\r\n		<div class="clear"></div>\r\n	</div>\r\n</div>\r\n\r\n\r\n\r\n<div id="footer">\r\n  <p>MySQL: [^qt^], [^q^] request(s), PHP: [^p^], total: [^t^], document retrieved from [^s^]</p>\r\n</div>\r\n\r\n<div class="clear"></div>\r\n\r\n<script src="assets/templates/shop/script.js" type="text/javascript"></script>\r\n\r\n</body>\r\n</html>', 0),
(38, 'CheckoutForm', '', 0, 0, 0, '[!eForm? &gotoid=`16`&vericode=`1`&formid=`shopOrderForm`&tpl=`shopOrderForm`&report=`shopOrderReport`&subject=`Новый заказ`&eFormOnBeforeMailSent=`populateOrderData`&eFormOnMailSent=`sendOrderToManager`&protectSubmit=`0`!]\r\n', 0),
(37, 'CheckoutFormWebUser', '', 0, 0, 0, '[!eForm? &gotoid=`16`&vericode=`1`&formid=`shopOrderForm`&tpl=`shopOrderFormWebUser`&report=`shopOrderReportWebUser`&subject=`Новый заказ`&eFormOnBeforeMailSent=`populateOrderData`&eFormOnMailSent=`sendOrderToManager`!]\r\n', 0),
(36, 'shopStuff3', '', 0, 0, 0, '<div class="shop-stuff shk-item">\r\n  <div class="shop-stuff-b">\r\n    <h3>[+pagetitle+]</h3>\r\n    <form action="" method="post">\r\n    <div class="shs-descr">\r\n    <img class="shk-image" src="[+image+]" alt="" height="130" width="130" />\r\n      [+introtext+]\r\n      <br clear="all" />\r\n      <small>На складе: [+inventory+]</small>\r\n      <div>[+param1:shk_widget=`checkbox:param1`+]</div>\r\n    </div>\r\n      <input type="hidden" name="shk-id" value="[+id+]" />\r\n      <input type="hidden" name="shk-price" value="[+price+]" />\r\n      <input type="hidden" name="shk-count" value="1" size="2" maxlength="3" />\r\n      <div class="shs-price">\r\n        <button type="submit" name="shk-submit" class="shk-but">В корзину</button>\r\n        <div>Цена: <span class="shk-price">[+price+]</span> руб.</div>\r\n      </div>\r\n    </form>\r\n  </div>\r\n</div>', 0);

-- --------------------------------------------------------

TRUNCATE TABLE `{PREFIX}site_templates`;

--
-- Дамп данных таблицы `{PREFIX}site_templates`
--

INSERT INTO `{PREFIX}site_templates` (`id`, `templatename`, `description`, `editor_type`, `category`, `icon`, `template_type`, `content`, `locked`) VALUES
(14, 'Страница товара 4', '', 0, 13, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n<br />\r\n\r\n<div class="shs-tocart shk-item">\r\n<form action="[+action+]" method="post">\r\n  <input type="hidden" name="shk-id" value="[*id*]" />\r\n  <input type="hidden" name="shk-count" value="1" size="2" maxlength="3" />\r\n  <div align="right">\r\n    <div class="materials">\r\n      Доступные материалы<br><br>\r\n      [*material:shk_widget=`radioimage:material:first_selected:desc_page`*]\r\n    </div>\r\n    Цена: <span class="shk-price" id="stuff_[*id*]_price">[*price*]</span> руб.\r\n    <button type="submit" name="shk-submit" class="shk-but">В корзину</button>\r\n  </div>\r\n</form>\r\n</div>\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n		<div class="rightmenu">\r\n      \r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n      \r\n		</div>\r\n    \r\n    [!Shopkeeper? &carType=`small`&priceTV=`price`&orderFormPage=`15`&gotoid=`16`&flyToCart=`nofly`&counterField=`1`!]\r\n    \r\n    <br /><br />\r\n    \r\n    [!WebLogin? &tpl=`weblogin`&loginhomeid=`2`&logouthomeid=`1`!]\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(15, 'Text page', '', 0, 14, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n		<div class="rightmenu">\r\n      \r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n      \r\n		</div>\r\n    \r\n    [!Shopkeeper? &orderFormPage=`31`&tplPath=`assets/snippets/shopkeeper/chunks/en/`&cartType=`small`&lang=`english`&currency=`USD`!]\r\n    \r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(16, 'Text page 2', '', 0, 14, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n		<div class="rightmenu">\r\n      \r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n      \r\n		</div>\r\n    \r\n    [!Shopkeeper? &orderFormPage=`31`&tplPath=`assets/snippets/shopkeeper/chunks/en/`&cartType=`full`&lang=`english`&currency=`USD`&flyToCart=`nofly`&counterField=`1`!]\r\n    \r\n\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(18, 'Страница оформления заказа', '', 0, 13, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n\r\n[!Shopkeeper? &orderFormPage=`15` &flyToCart=`nofly` &orderDataTpl=`@FILE:chunk_orderDataTpl.tpl`&cartRowTpl=`@FILE:chunk_shopCartRow2.tpl`!]\r\n\r\n<script type="text/javascript">\r\nfunction setCartActionsCallback(){\r\n  var dlvrName = ''На дом'';\r\n  var dlvrRow = $("tr:contains(''Доставка'')","#shopCart");\r\n  var dlvrIndex = typeof(dlvrRow.get(0))!=''undefined'' ? dlvrRow.prevAll().size() : null;\r\n  $(''#delivery_select'').unbind(''change'').bind(''change'',function(){\r\n    if(this.value==dlvrName){\r\n      $.fillCart(82);\r\n    }else{\r\n      if(dlvrIndex!=null)\r\n        $.deleteItem(dlvrIndex);\r\n    }\r\n  });\r\n  if(dlvrIndex!=null){\r\n    $(''#delivery_select'').val(dlvrName);\r\n  }else{\r\n    if($(''#delivery_select'').val()==dlvrName)\r\n      $(''#delivery_select'').val('''');\r\n  }\r\n}\r\n</script>\r\n\r\n\r\n[[Personalize? &yesChunk=`CheckoutFormWebUser` &noChunk=`CheckoutForm` &ph=`name`]]\r\n\r\n\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n		<div class="rightmenu">\r\n      \r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n      \r\n		</div>\r\n    \r\n    [!WebLogin? &tpl=`weblogin`&loginhomeid=`2`&logouthomeid=`1`!]\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(17, 'Product page', '', 0, 14, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n<br />\r\n\r\n{{shopToCart_eng}}\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n		<div class="rightmenu">\r\n      \r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n      \r\n		</div>\r\n    \r\n    [!Shopkeeper? &orderFormPage=`31`&cartType=`small`&lang=`english`&currency=`USD`!]\r\n    \r\n    <br /><br />\r\n    \r\n    [!WebLogin? &tpl=`weblogin`&loginhomeid=`2`&logouthomeid=`1`!]\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(19, 'Checkout_page', '', 0, 14, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n[!Shopkeeper? &lang=`english` &currency=`USD` &tplPath=`assets/snippets/shopkeeper/chunks/en/` &cartTpl=`@FILE:chunk_shopCart.tpl` &orderFormPage=`31` &gotoid=`32` &inventory=`inventory`!]\r\n\r\n\r\n<script type="text/javascript">\r\nfunction setCartActionsCallback(){\r\n  var dlvrName = ''На дом'';\r\n  var dlvrRow = $("tr:contains(''Доставка'')","#shopCart");\r\n  var dlvrIndex = typeof(dlvrRow.get(0))!=''undefined'' ? dlvrRow.prevAll().size() : null;\r\n  $(''#delivery_select'').unbind(''change'').bind(''change'',function(){\r\n    if(this.value==dlvrName){\r\n      $.fillCart(82);\r\n    }else{\r\n      if(dlvrIndex!=null)\r\n        $.deleteItem(dlvrIndex);\r\n    }\r\n  });\r\n  if(dlvrIndex!=null){\r\n    $(''#delivery_select'').val(dlvrName);\r\n  }else{\r\n    if($(''#delivery_select'').val()==dlvrName)\r\n      $(''#delivery_select'').val('''');\r\n  }\r\n}\r\n</script>\r\n\r\n[[Personalize? &yesChunk=`CheckoutFormWebUser_eng` &noChunk=`CheckoutForm_eng` &ph=`name`]]\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n		<div class="rightmenu">\r\n      \r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n      \r\n		</div>\r\n    \r\n    [!WebLogin? &tpl=`weblogin`&loginhomeid=`2`&logouthomeid=`1`!]\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(5, 'Текстовая страница', '', 0, 13, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n      \r\n{{right_col}}\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(6, 'Пример 1', '', 0, 13, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n[[catalogView? &dataType=`documents`&tpl=`@FILE:assets/snippets/shopkeeper/chunks/ru/chunk_shopStuff.tpl`]]\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n\r\n<div class="rightmenu">\r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n</div>\r\n\r\n[!Shopkeeper? &cartType=`small`&priceTV=`price`&orderFormPage=`15`!]\r\n\r\n<br /><br />\r\n\r\n[!WebLogin? &tpl=`weblogin`&loginhomeid=`2`&logouthomeid=`1`!]\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(7, 'Пример 2', '', 0, 13, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n[[catalogView? &dataType=`documents`&tpl=`shopStuff2`]]\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n		<div class="rightmenu">\r\n      \r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n      \r\n		</div>\r\n    \r\n    [!Shopkeeper? &priceTV=`price`&orderFormPage=`15`&gotoid=`16`&flyToCart=`nofly`&counterField=`1`!]\r\n    \r\n    <br /><br />\r\n    \r\n    [!WebLogin? &tpl=`weblogin`&loginhomeid=`2`&logouthomeid=`1`!]\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(8, 'Пример 3', '', 0, 13, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n[[catalogView? &dataType=`documents`&tpl=`shopStuff3`]]\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n		<div class="rightmenu">\r\n      \r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n      \r\n		</div>\r\n    \r\n    [!Shopkeeper? &orderFormPage=`15`&gotoid=`16`&changePrice=`1`&flyToCart=`image`&linkAllow=`0`&inventory=`inventory`&cartRowTpl=`@FILE:chunk_shopCartRow2.tpl`!]\r\n    \r\n    <br /><br />\r\n    \r\n    [!WebLogin? &tpl=`weblogin`&loginhomeid=`2`&logouthomeid=`1`!]\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(9, 'Пример 4', '', 0, 13, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n\r\n<a href="#" onclick="jQuery.emptyCart();return false;">jQuery.emptyCart()</a>\r\n&nbsp;&nbsp;\r\n<a href="#" onclick="jQuery.refreshCart();return false;">jQuery.refreshCart()</a>\r\n<br /><br />\r\n\r\n\r\n[!catalogView? &dataType=`documents`&display=`2`&paginate=`1`&tpl=`shopStuff4`&orderBy=`menuindex ASC`!]\r\n\r\n<div class="clear"></div>\r\n\r\n[!include? &placeholder=`pages`!]\r\n\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n		<div class="rightmenu">\r\n      \r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n      \r\n		</div>\r\n    [!Shopkeeper? &orderFormPage=`15`&gotoid=`16`&flyToCart=`image`&counterField=`1`&cartHelperTpl=`@FILE:chunk_shopCartHelper.tpl`!]\r\n    \r\n    <br /><br />\r\n    \r\n    [!WebLogin? &tpl=`weblogin`&loginhomeid=`2`&logouthomeid=`1`!]\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(10, 'Пример 5', '', 0, 13, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n[[catalogView? &dataType=`documents`&tpl=`@FILE:assets/snippets/shopkeeper/chunks/ru/chunk_shopStuff_2.tpl`]]\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n		<div class="rightmenu">\r\n      \r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n      \r\n		</div>\r\n    \r\n    [!Shopkeeper? &priceTV=`price`&orderFormPage=`15`&changePrice=`1`&flyToCart=`nofly`&counterField=`1`!]\r\n    \r\n    <br /><br />\r\n    \r\n    [!WebLogin? &tpl=`weblogin`&loginhomeid=`2`&logouthomeid=`1`!]\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(11, 'Пример 6', '', 0, 13, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n[!include? &chunk=`@FILE:assets/snippets/shopkeeper/chunks/ru/sort_filter.tpl`&parse=`0`!]\r\n\r\n<br />\r\n\r\n[!catalogView? &tpl=`@FILE:assets/snippets/catalogView/chunks/catalogRow_chunk.tpl`&paginate=`1`&display=`2`&sortBy=`pagetitle`&sortDir=`asc`!]\r\n\r\n<br clear="all" />\r\n\r\n[!include? &placeholder=`pages`!]\r\n\r\n<br /><br />\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n		<div class="rightmenu">\r\n      \r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n      \r\n		</div>\r\n    \r\n    [!Shopkeeper? &cartType=`full`&priceTV=`price`&orderFormPage=`15`&flyToCart=`nofly`&counterField=`1`!]\r\n    \r\n    <br /><br />\r\n    \r\n    [!WebLogin? &tpl=`weblogin`&loginhomeid=`2`&logouthomeid=`1`!]\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0),
(13, 'Страница товара', '', 0, 13, '', 0, '{{header}}\r\n\r\n<div id="content">\r\n\r\n\r\n<h1>[*pagetitle*]</h1>\r\n\r\n[*content*]\r\n\r\n<br />\r\n\r\n{{shopToCart}}\r\n\r\n  <div class="clear"></div>\r\n</div>\r\n\r\n<div id="sidebar">\r\n		<div class="rightmenu">\r\n      \r\n      [!Wayfinder? &startId=`[[UltimateParent? &topLevel=`1`]]`&level=`1`&hideSubMenus=`true`&displayStart=`true`&sortOrder=`ASC`&sortBy=`menuindex`!]\r\n      \r\n		</div>\r\n    \r\n    [!Shopkeeper? &cartType=`small`&priceTV=`price`&orderFormPage=`15`&gotoid=`16`&flyToCart=`nofly`&counterField=`1`!]\r\n    \r\n    <br /><br />\r\n    \r\n    [!WebLogin? &tpl=`weblogin`&loginhomeid=`2`&logouthomeid=`1`!]\r\n    \r\n  <div class="clear"></div>\r\n</div>\r\n    \r\n{{footer}}', 0);

-- --------------------------------------------------------

TRUNCATE TABLE `{PREFIX}site_tmplvars`;

--
-- Дамп данных таблицы `{PREFIX}site_tmplvars`
--

INSERT INTO `{PREFIX}site_tmplvars` (`id`, `type`, `name`, `caption`, `description`, `editor_type`, `category`, `locked`, `elements`, `rank`, `display`, `display_params`, `default_text`) VALUES
(1, 'text', 'price', 'Цена', '', 0, 0, 0, '', 0, '', '', ''),
(2, 'textarea', 'param1', 'Доп. параметр 1', '', 0, 0, 0, '', 5, '', '', ''),
(3, 'textarea', 'param2', 'Доп. параметр 2', '', 0, 0, 0, '', 6, '', '', ''),
(4, 'image', 'image', 'Фото', '', 0, 0, 0, '', 4, '', '&align=none', ''),
(7, 'text', 'inventory', 'Кол-во на складе', '', 0, 0, 0, '', 3, '', '', ''),
(9, 'checkbox', 'material', 'Материал', '', 0, 0, 0, '@SELECT cnt.pagetitle, tvc.id FROM {PREFIX}site_content cnt, {PREFIX}site_tmplvar_contentvalues tvc WHERE cnt.id = tvc.contentid AND tvc.tmplvarid = 4 AND cnt.parent = 48\r\n', 8, 'delim', '&align=none&format=,&default=No&tagname=div', ''),
(13, 'text', 'price_rent', 'Цена проката', '', 0, 0, 0, '', 2, '', '', '');

-- --------------------------------------------------------

TRUNCATE TABLE `{PREFIX}site_tmplvar_contentvalues`;

--
-- Дамп данных таблицы `{PREFIX}site_tmplvar_contentvalues`
--

INSERT INTO `{PREFIX}site_tmplvar_contentvalues` (`id`, `tmplvarid`, `contentid`, `value`) VALUES
(171, 1, 45, '28'),
(172, 4, 45, 'assets/images/mouse.jpg'),
(170, 7, 45, '96'),
(168, 4, 44, 'assets/images/keyboard.jpg'),
(167, 1, 44, '20.7'),
(166, 7, 44, '85'),
(164, 1, 43, '15'),
(163, 4, 43, 'assets/images/mouse_pad.jpg'),
(162, 7, 43, '90'),
(349, 1, 82, '100'),
(181, 4, 49, 'assets/images/mats/267b.jpg'),
(327, 13, 78, '130'),
(437, 2, 98, 'провод 5 м==230'),
(330, 9, 78, '182||183||184'),
(331, 7, 79, '90'),
(332, 1, 79, '650'),
(333, 4, 79, 'assets/images/mouse.jpg'),
(434, 2, 97, '+ шнурок==50'),
(336, 13, 79, '130'),
(436, 2, 99, 'с клавишей CtrlAltDel==200'),
(435, 2, 100, 'с драйвером==110'),
(339, 9, 79, '181||183||184'),
(341, 9, 80, '181||183||185'),
(342, 4, 80, 'assets/images/usb_flash.jpg'),
(343, 1, 80, '300'),
(344, 7, 80, '90'),
(346, 13, 80, '130'),
(322, 7, 78, '90'),
(323, 1, 78, '488.77'),
(324, 4, 78, 'assets/images/keyboard.jpg'),
(317, 9, 77, '181||184||185'),
(318, 13, 77, '130'),
(313, 7, 77, '60'),
(314, 4, 77, 'assets/images/mouse_pad.jpg'),
(315, 1, 77, '330'),
(174, 3, 43, 'pink==0||black==0'),
(175, 3, 44, 'pink==0||black==0'),
(176, 3, 45, 'pink==0'),
(177, 2, 43, '--extra--==||gift wrap==5||gift bag==7'),
(178, 2, 44, '--extra--==||gift wrap==5||gift bag==7'),
(179, 2, 45, '--extra--==||gift wrap==5||gift bag==7'),
(182, 4, 50, 'assets/images/mats/268b.jpg'),
(183, 4, 51, 'assets/images/mats/271b.jpg'),
(184, 4, 52, 'assets/images/mats/55b.jpg'),
(185, 4, 53, 'assets/images/mats/56b.jpg'),
(350, 1, 89, '300'),
(351, 7, 89, '90'),
(352, 4, 89, 'assets/images/usb_flash.jpg'),
(355, 1, 90, '650'),
(356, 7, 90, '90'),
(357, 4, 90, 'assets/images/mouse.jpg'),
(360, 1, 91, '488.77'),
(361, 7, 91, '90'),
(362, 4, 91, 'assets/images/keyboard.jpg'),
(365, 1, 92, '330'),
(366, 7, 92, '60'),
(367, 4, 92, 'assets/images/mouse_pad.jpg'),
(370, 1, 93, '300'),
(371, 7, 93, '90'),
(372, 4, 93, 'assets/images/usb_flash.jpg'),
(373, 2, 93, '==||Упаковка==50||Сумочка==120'),
(374, 3, 93, 'розовый==0||черный==0'),
(375, 1, 94, '650'),
(376, 7, 94, '90'),
(377, 4, 94, 'assets/images/mouse.jpg'),
(378, 2, 94, 'Упаковка==50||Сумочка==120'),
(379, 3, 94, 'розовый==0||черный==0'),
(380, 1, 95, '488.77'),
(381, 7, 95, '90'),
(382, 4, 95, 'assets/images/keyboard.jpg'),
(383, 2, 95, '==||Упаковка==50||Сумочка==120'),
(384, 3, 95, 'розовый==0||черный==0'),
(385, 1, 96, '330'),
(386, 7, 96, '60'),
(387, 4, 96, 'assets/images/mouse_pad.jpg'),
(388, 2, 96, '==||Упаковка==50||Сумочка==120'),
(389, 3, 96, 'розовый==0||черный==0'),
(390, 1, 97, '300'),
(391, 7, 97, '90'),
(392, 4, 97, 'assets/images/usb_flash.jpg'),
(395, 1, 98, '650'),
(396, 7, 98, '90'),
(397, 4, 98, 'assets/images/mouse.jpg'),
(400, 1, 99, '488.77'),
(401, 7, 99, '90'),
(402, 4, 99, 'assets/images/keyboard.jpg'),
(405, 1, 100, '330'),
(406, 7, 100, '60'),
(407, 4, 100, 'assets/images/mouse_pad.jpg'),
(410, 1, 101, '300'),
(411, 7, 101, '90'),
(412, 4, 101, 'assets/images/usb_flash.jpg'),
(415, 1, 102, '650'),
(416, 7, 102, '90'),
(417, 4, 102, 'assets/images/mouse.jpg'),
(420, 1, 103, '488.77'),
(421, 7, 103, '90'),
(422, 4, 103, 'assets/images/keyboard.jpg'),
(425, 1, 104, '330'),
(426, 7, 104, '60'),
(427, 4, 104, 'assets/images/mouse_pad.jpg'),
(431, 13, 103, '100'),
(430, 13, 104, '100'),
(432, 13, 102, '100'),
(433, 13, 101, '100');

-- --------------------------------------------------------

--
-- Дамп данных таблицы `{PREFIX}site_tmplvar_templates`
--
TRUNCATE TABLE `{PREFIX}site_tmplvar_templates`;

INSERT INTO `{PREFIX}site_tmplvar_templates` (`tmplvarid`, `templateid`, `rank`) VALUES
(14, 13, 0),
(7, 14, 0),
(9, 17, 0),
(13, 13, 0),
(2, 17, 0),
(9, 14, 0),
(7, 17, 0),
(4, 14, 0),
(14, 14, 0),
(1, 13, 0),
(3, 13, 0),
(2, 13, 0),
(9, 13, 0),
(7, 13, 0),
(2, 14, 0),
(4, 13, 0),
(13, 17, 0),
(1, 17, 0),
(14, 17, 0),
(3, 17, 0),
(3, 14, 0),
(1, 14, 0),
(4, 17, 0),
(13, 14, 0);

-- --------------------------------------------------------

--
-- Дамп данных таблицы `{PREFIX}system_eventnames`
--

REPLACE INTO `{PREFIX}system_eventnames` (`id`, `name`, `service`, `groupname`) VALUES
(1102, 'OnSHKcalcTotalPrice', 6, 'Shopkeeper'),
(1101, 'OnSHKsaveOrder', 6, 'Shopkeeper'),
(1100, 'OnSHKbeforeSendOrder', 6, 'Shopkeeper'),
(1099, 'OnSHKmodPagePrint', 6, 'Shopkeeper'),
(1098, 'OnSHKmodRenderTopLinks', 6, 'Shopkeeper'),
(1096, 'OnSHKcartLoad', 6, 'Shopkeeper'),
(1097, 'OnSHKstatusSendMail', 6, 'Shopkeeper'),
(1095, 'OnSHKMailApprovedForPayment', 6, 'Shopkeeper'),
(1094, 'OnSHKOrderDescRender', 6, 'Shopkeeper'),
(1093, 'OnSHKFrontendInit', 6, 'Shopkeeper'),
(1092, 'OnSHKChangeStatus', 6, 'Shopkeeper');

-- --------------------------------------------------------

UPDATE `{PREFIX}site_plugins` SET `disabled` = '1' WHERE `{PREFIX}site_plugins`.`name` = 'Quick Manager+' LIMIT 1 ;
