<?php

$langTxt = array(

  "verify_email" => "Пожалуйста, проверьте корректность, указанного вами, адреса электронной почты",
  "payment_desc" => "Оплата заказа [+orderID+]",
  "payment_button" => "Оплатить сейчас",
  "reserved" => "Ваш заказ принят. После проверки менеджером Вы сможете его оплатить, после чего покупка будет отправленна Вам выбранным способом доставки.",
  
  "error_1" => "Заказ не найден.",
  "error_2" => "Истек срок резервирования товара.",
  "error_3" => "Заказ не готов к оплате."
  
  
);


?>